OpenPuya/PY32F0xx_Firmware/Packs/GCC/.pack/Puya/PY32F0xx_DFP/Puya.PY32F0xx_DFP.pdsc
        <!-- *************************  Device 'PY32F071Cx9'  ***************************** -->
        <device Dname="PY32F071Cx9">
          <compile header="Drivers/CMSIS/Device/Puya/PY32F0xx/Include/py32f0xx.h" />
          <memory name="IROM1" access="rx" start="0x08000000" size="0x00018000" startup="1" default="1"/>
          <memory name="IRAM1" access="rw" start="0x20000000" size="0x00003000" init   ="0" default="1"/>
          <algorithm name="CMSIS/Flash/PY32F071xx_96.FLM" start="0x08000000" size="0x00018000" default="1"/>
          <algorithm name="CMSIS/Flash/PY32F071xx_OPT.FLM" start="0x1FFF3100" size="0x00000020" default="0"/>
        </device>

        <!-- *************************  Device 'PY32F071CxB'  ***************************** -->
        <device Dname="PY32F071CxB">
          <compile header="Drivers/CMSIS/Device/Puya/PY32F0xx/Include/py32f0xx.h" />
          <memory name="IROM1" access="rx" start="0x08000000" size="0x00020000" startup="1" default="1"/>
          <memory name="IRAM1" access="rw" start="0x20000000" size="0x00004000" init   ="0" default="1"/>
          <algorithm name="CMSIS/Flash/PY32F071xx_128.FLM" start="0x08000000" size="0x00020000" default="1"/>
          <algorithm name="CMSIS/Flash/PY32F071xx_OPT.FLM" start="0x1FFF3100" size="0x00000020" default="0"/>
        </device>
      </subFamily>

      <!-- ************************  Subfamily 'PY32F072'  **************************** -->
      <subFamily DsubFamily="PY32F072">
        <processor Dclock="48000000"/>
        <debug svd="CMSIS/SVD/PY32F072xx.svd"/>
        <debugvars configfile="CMSIS/Debug/PY32F072xx.dbgconf">
          __var DbgMCU_CR      = 0x00000002;   // DBGMCU_CR:  DBG_STOP, DBG_STANDBY
          __var DbgMCU_APB_Fz1 = 0x00000000;   // DGBMCU_APB_FZ1: All Peripherals Operate as in Normal Mode
          __var DbgMCU_APB_Fz2 = 0x00000000;   // DGBMCU_APB_FZ2: All Peripherals Operate as in Normal Mode
        </debugvars>
        <sequences>
          <!-- Override for Pre-Defined Sequences -->
          <sequence name="DebugCoreStart">
            <block>
            // Replication of Standard Functionality
            Write32(0xE000EDF0, 0xA05F0001);                                        // Enable Core Debug via DHCSR
            </block>

            <block info="DbgMCU registers">
            // Device Specific Debug Setup
            Write32(0x40021040, Read32(0x40021040) | 0x00000400);                   // Set RCC_APBENR1.DBGEN

            Write32(0x40015804, DbgMCU_CR);                                         // DBGMCU_CR: Configure MCU Debug
            Write32(0x40015808, DbgMCU_APB_Fz1);                                    // DBGMCU_APB_FZ1: Configure APB Peripheral Freeze1 Behavior
            Write32(0x4001580C, DbgMCU_APB_Fz2);                                    // DBGMCU_APB_FZ2: Configure APB Peripheral Freeze2 Behavior
            </block>
          </sequence>
        </sequences>

        <!-- *************************  Device 'PY32F072x6'  ***************************** -->
        <device Dname="PY32F072x6">
          <compile header="Drivers/CMSIS/Device/Puya/PY32F0xx/Include/py32f0xx.h" />
          <memory name="IROM1" access="rx" start="0x08000000" size="0x00008000" startup="1" default="1"/>
          <memory name="IRAM1" access="rw" start="0x20000000" size="0x00001000" init   ="0" default="1"/>
          <algorithm name="CMSIS/Flash/PY32F072xx_32.FLM" start="0x08000000" size="0x00008000" default="1"/>
          <algorithm name="CMSIS/Flash/PY32F072xx_OPT.FLM" start="0x1FFF3100" size="0x00000020" default="0"/>
        </device>

        <!-- *************************  Device 'PY32F072x8'  ***************************** -->
        <device Dname="PY32F072x8">
          <compile header="Drivers/CMSIS/Device/Puya/PY32F0xx/Include/py32f0xx.h" />
          <memory name="IROM1" access="rx" start="0x08000000" size="0x00010000" startup="1" default="1"/>
          <memory name="IRAM1" access="rw" start="0x20000000" size="0x00002000" init   ="0" default="1"/>
          <algorithm name="CMSIS/Flash/PY32F072xx_64.FLM" start="0x08000000" size="0x00010000" default="1"/>
          <algorithm name="CMSIS/Flash/PY32F072xx_OPT.FLM" start="0x1FFF3100" size="0x00000020" default="0"/>
        </device>

        <!-- *************************  Device 'PY32F072x9'  ***************************** -->
        <device Dname="PY32F072x9">
          <compile header="Drivers/CMSIS/Device/Puya/PY32F0xx/Include/py32f0xx.h" />
          <memory name="IROM1" access="rx" start="0x08000000" size="0x00018000" startup="1" default="1"/>
          <memory name="IRAM1" access="rw" start="0x20000000" size="0x00003000" init   ="0" default="1"/>
          <algorithm name="CMSIS/Flash/PY32F072xx_96.FLM" start="0x08000000" size="0x00018000" default="1"/>
          <algorithm name="CMSIS/Flash/PY32F072xx_OPT.FLM" start="0x1FFF3100" size="0x00000020" default="0"/>
        </device>

        <!-- *************************  Device 'PY32F072xB'  ***************************** -->
        <device Dname="PY32F072xB">
          <compile header="Drivers/CMSIS/Device/Puya/PY32F0xx/Include/py32f0xx.h" />
          <memory name="IROM1" access="rx" start="0x08000000" size="0x00020000" startup="1" default="1"/>
          <memory name="IRAM1" access="rw" start="0x20000000" size="0x00004000" init   ="0" default="1"/>
          <algorithm name="CMSIS/Flash/PY32F072xx_128.FLM" start="0x08000000" size="0x00020000" default="1"/>
          <algorithm name="CMSIS/Flash/PY32F072xx_OPT.FLM" start="0x1FFF3100" size="0x00000020" default="0"/>
        </device>
      </subFamily>

      <!-- ************************  Subfamily 'PY32F072C'  **************************** -->
      <subFamily DsubFamily="PY32F072C">
        <processor Dclock="48000000"/>
        <debug svd="CMSIS/SVD/PY32F072Cxx.svd"/>
        <debugvars configfile="CMSIS/Debug/PY32F072xx.dbgconf">
          __var DbgMCU_CR      = 0x00000002;   // DBGMCU_CR:  DBG_STOP, DBG_STANDBY
          __var DbgMCU_APB_Fz1 = 0x00000000;   // DGBMCU_APB_FZ1: All Peripherals Operate as in Normal Mode
          __var DbgMCU_APB_Fz2 = 0x00000000;   // DGBMCU_APB_FZ2: All Peripherals Operate as in Normal Mode
        </debugvars>
        <sequences>
          <!-- Override for Pre-Defined Sequences -->
          <sequence name="DebugCoreStart">
            <block>
            // Replication of Standard Functionality
            Write32(0xE000EDF0, 0xA05F0001);                                        // Enable Core Debug via DHCSR
            </block>

            <block info="DbgMCU registers">
            // Device Specific Debug Setup
            Write32(0x40021040, Read32(0x40021040) | 0x00000400);                   // Set RCC_APBENR1.DBGEN

