OpenPuya/PY32F0xx_Firmware/Packs/GCC/.pack/Puya/PY32F0xx_DFP/Puya.PY32F0xx_DFP.pdsc
            Write32(0x40015804, DbgMCU_CR);                                         // DBGMCU_CR: Configure MCU Debug
            Write32(0x40015808, DbgMCU_APB_Fz1);                                    // DBGMCU_APB_FZ1: Configure APB Peripheral Freeze1 Behavior
            Write32(0x4001580C, DbgMCU_APB_Fz2);                                    // DBGMCU_APB_FZ2: Configure APB Peripheral Freeze2 Behavior
            </block>
          </sequence>
        </sequences>
        <!-- *************************  Device 'PY32F072Cx6'  ***************************** -->
        <device Dname="PY32F072Cx6">
          <compile header="Drivers/CMSIS/Device/Puya/PY32F0xx/Include/py32f0xx.h" />
          <memory name="IROM1" access="rx" start="0x08000000" size="0x00008000" startup="1" default="1"/>
          <memory name="IRAM1" access="rw" start="0x20000000" size="0x00001000" init   ="0" default="1"/>
          <algorithm name="CMSIS/Flash/PY32F072xx_32.FLM" start="0x08000000" size="0x00008000" default="1"/>
          <algorithm name="CMSIS/Flash/PY32F072xx_OPT.FLM" start="0x1FFF3100" size="0x00000020" default="0"/>
        </device>

        <!-- *************************  Device 'PY32F072Cx8'  ***************************** -->
        <device Dname="PY32F072Cx8">
          <compile header="Drivers/CMSIS/Device/Puya/PY32F0xx/Include/py32f0xx.h" />
          <memory name="IROM1" access="rx" start="0x08000000" size="0x00010000" startup="1" default="1"/>
          <memory name="IRAM1" access="rw" start="0x20000000" size="0x00002000" init   ="0" default="1"/>
          <algorithm name="CMSIS/Flash/PY32F072xx_64.FLM" start="0x08000000" size="0x00010000" default="1"/>
          <algorithm name="CMSIS/Flash/PY32F072xx_OPT.FLM" start="0x1FFF3100" size="0x00000020" default="0"/>
        </device>

        <!-- *************************  Device 'PY32F072Cx9'  ***************************** -->
        <device Dname="PY32F072Cx9">
          <compile header="Drivers/CMSIS/Device/Puya/PY32F0xx/Include/py32f0xx.h" />
          <memory name="IROM1" access="rx" start="0x08000000" size="0x00018000" startup="1" default="1"/>
          <memory name="IRAM1" access="rw" start="0x20000000" size="0x00003000" init   ="0" default="1"/>
          <algorithm name="CMSIS/Flash/PY32F072xx_96.FLM" start="0x08000000" size="0x00018000" default="1"/>
          <algorithm name="CMSIS/Flash/PY32F072xx_OPT.FLM" start="0x1FFF3100" size="0x00000020" default="0"/>
        </device>

        <!-- *************************  Device 'PY32F072CxB'  ***************************** -->
        <device Dname="PY32F072CxB">
          <compile header="Drivers/CMSIS/Device/Puya/PY32F0xx/Include/py32f0xx.h" />
          <memory name="IROM1" access="rx" start="0x08000000" size="0x00020000" startup="1" default="1"/>
          <memory name="IRAM1" access="rw" start="0x20000000" size="0x00004000" init   ="0" default="1"/>
          <algorithm name="CMSIS/Flash/PY32F072xx_128.FLM" start="0x08000000" size="0x00020000" default="1"/>
          <algorithm name="CMSIS/Flash/PY32F072xx_OPT.FLM" start="0x1FFF3100" size="0x00000020" default="0"/>
        </device>
      </subFamily>

    </family>
  </devices>

  <conditions>
    <!-- Compiler Conditions -->
    <condition id="Compiler ARMCC">
      <require Tcompiler="ARMCC"/>
    </condition>

    <!-- Device Conditions -->
    <condition id="PY32F0">
      <description>Puya PYF0 Series Devices</description>
      <require Dvendor="Puya:176" Dname="PY32F0*"/>
    </condition>

    <condition id="PY32F0 CMSIS">
      <description>Puya PY32F0 Series devices and CMSIS</description>
      <require condition="PY32F0"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>
    <condition id="PY32F002A Series">
      <description>Puya PY32F002A Series</description>
      <require Dvendor="Puya:176" Dname="PY32F002A*"/>
    </condition>
    <condition id="PY32F002Ax5">
      <description>Puya PY32F002Ax5 Devices</description>
      <require Dvendor="Puya:176" Dname="PY32F002A?5*"/>
    </condition>
    <condition id="PY32F002B Series">
      <description>Puya PY32F002B Series</description>
      <require Dvendor="Puya:176" Dname="PY32F002B*"/>
    </condition>
    <condition id="PY32F002Bx5">
      <description>Puya PY32F002Bx5 Devices</description>
      <require Dvendor="Puya:176" Dname="PY32F002B?5*"/>
    </condition>
    <condition id="PY32F002X Series">
      <description>Puya PY32F002X Series</description>
      <require Dvendor="Puya:176" Dname="PY32F002X*"/>
    </condition>
    <condition id="PY32F002Xx2">
      <description>Puya PY32F002Xx2 Devices</description>
      <require Dvendor="Puya:176" Dname="PY32F002X?2*"/>
    </condition>
    <condition id="PY32F002Xx4">
      <description>Puya PY32F002Xx4 Devices</description>
      <require Dvendor="Puya:176" Dname="PY32F002X?4*"/>
    </condition>
    <condition id="PY32F002Xx5">
      <description>Puya PY32F002Xx5 Devices</description>
      <require Dvendor="Puya:176" Dname="PY32F002X?5*"/>
    </condition>
    <condition id="PY32F003 Series">
      <description>Puya PY32F003 Series</description>
      <require Dvendor="Puya:176" Dname="PY32F003*"/>
    </condition>
    <condition id="PY32F003x4">
      <description>Puya PY32F003x4 Devices</description>
      <require Dvendor="Puya:176" Dname="PY32F003?4*"/>
    </condition>
    <condition id="PY32F003x6">
      <description>Puya PY32F003x6 Devices</description>
      <require Dvendor="Puya:176" Dname="PY32F003?6*"/>
    </condition>
    <condition id="PY32F003x7">
      <description>Puya PY32F003x7 Devices</description>
      <require Dvendor="Puya:176" Dname="PY32F003?7*"/>
    </condition>
    <condition id="PY32F003x8">
      <description>Puya PY32F003x8 Devices</description>
      <require Dvendor="Puya:176" Dname="PY32F003?8*"/>
    </condition>
    <condition id="PY32F030 Series">
      <description>Puya PY32F030 Series</description>
      <require Dvendor="Puya:176" Dname="PY32F030*"/>
    </condition>
