OpenPuya/PY32F0xx_Firmware/Packs/GCC/.pack/Puya/PY32F0xx_DFP/Puya.PY32F0xx_DFP.pdsc
    <condition id="PY32F030x4">
      <description>Puya PY32F030x4 Devices</description>
      <require Dvendor="Puya:176" Dname="PY32F030?4*"/>
    </condition>
    <condition id="PY32F030x6">
      <description>Puya PY32F030x6 Devices</description>
      <require Dvendor="Puya:176" Dname="PY32F030?6*"/>
    </condition>
    <condition id="PY32F030x7">
      <description>Puya PY32F030x7 Devices</description>
      <require Dvendor="Puya:176" Dname="PY32F030?7*"/>
    </condition>
    <condition id="PY32F030x8">
      <description>Puya PY32F030x6 Devices</description>
      <require Dvendor="Puya:176" Dname="PY32F030?8*"/>
    </condition>
    <condition id="PY32F031 Series">
      <description>Puya PY32F031 Series</description>
      <require Dvendor="Puya:176" Dname="PY32F031*"/>
    </condition>
    <condition id="PY32F031x4">
      <description>Puya PY32F031x4 Devices</description>
      <require Dvendor="Puya:176" Dname="PY32F031?4*"/>
    </condition>
    <condition id="PY32F031x6">
      <description>Puya PY32F031x6 Devices</description>
      <require Dvendor="Puya:176" Dname="PY32F031?6*"/>
    </condition>
    <condition id="PY32F031x7">
      <description>Puya PY32F031x7 Devices</description>
      <require Dvendor="Puya:176" Dname="PY32F031?7*"/>
    </condition>
    <condition id="PY32F031x8">
      <description>Puya PY32F031x6 Devices</description>
      <require Dvendor="Puya:176" Dname="PY32F031?8*"/>
    </condition>
    <condition id="PY32F040 Series">
      <description>Puya PY32F040 Series</description>
      <require Dvendor="Puya:176" Dname="PY32F040x*"/>
    </condition>
    <condition id="PY32F040x6">
      <description>Puya PY32F040x6 Devices</description>
      <require Dvendor="Puya:176" Dname="PY32F040?6*"/>
    </condition>
    <condition id="PY32F040x8">
      <description>Puya PY32F040x8 Devices</description>
      <require Dvendor="Puya:176" Dname="PY32F040?8*"/>
    </condition>
    <condition id="PY32F040x9">
      <description>Puya PY32F040x9 Devices</description>
      <require Dvendor="Puya:176" Dname="PY32F040?9*"/>
    </condition>
    <condition id="PY32F040xB">
      <description>Puya PY32F040xB Devices</description>
      <require Dvendor="Puya:176" Dname="PY32F040?B*"/>
    </condition>
    <condition id="PY32F040C Series">
      <description>Puya PY32F040C Series</description>
      <require Dvendor="Puya:176" Dname="PY32F040Cx*"/>
    </condition>
    <condition id="PY32F040Cx6">
      <description>Puya PY32F040Cx6 Devices</description>
      <require Dvendor="Puya:176" Dname="PY32F040C?6*"/>
    </condition>
    <condition id="PY32F040Cx8">
      <description>Puya PY32F040Cx8 Devices</description>
      <require Dvendor="Puya:176" Dname="PY32F040C?8*"/>
    </condition>
    <condition id="PY32F040Cx9">
      <description>Puya PY32F040Cx9 Devices</description>
      <require Dvendor="Puya:176" Dname="PY32F040C?9*"/>
    </condition>
    <condition id="PY32F040CxB">
      <description>Puya PY32F040CxB Devices</description>
      <require Dvendor="Puya:176" Dname="PY32F040C?B*"/>
    </condition>
    <condition id="PY32F071 Series">
      <description>Puya PY32F071 Series</description>
      <require Dvendor="Puya:176" Dname="PY32F071x*"/>
    </condition>
    <condition id="PY32F071x6">
      <description>Puya PY32F071x6 Devices</description>
      <require Dvendor="Puya:176" Dname="PY32F071?6*"/>
    </condition>
    <condition id="PY32F071x8">
      <description>Puya PY32F071x8 Devices</description>
      <require Dvendor="Puya:176" Dname="PY32F071?8*"/>
    </condition>
    <condition id="PY32F071x9">
      <description>Puya PY32F071x9 Devices</description>
      <require Dvendor="Puya:176" Dname="PY32F071?9*"/>
    </condition>
    <condition id="PY32F071xB">
      <description>Puya PY32F071xB Devices</description>
      <require Dvendor="Puya:176" Dname="PY32F071?B*"/>
    </condition>
    <condition id="PY32F071C Series">
      <description>Puya PY32F071C Series</description>
      <require Dvendor="Puya:176" Dname="PY32F071Cx*"/>
    </condition>
    <condition id="PY32F071Cx6">
      <description>Puya PY32F071Cx6 Devices</description>
      <require Dvendor="Puya:176" Dname="PY32F071C?6*"/>
    </condition>
    <condition id="PY32F071Cx8">
      <description>Puya PY32F071Cx8 Devices</description>
      <require Dvendor="Puya:176" Dname="PY32F071C?8*"/>
    </condition>
    <condition id="PY32F071Cx9">
      <description>Puya PY32F071Cx9 Devices</description>
      <require Dvendor="Puya:176" Dname="PY32F071C?9*"/>
    </condition>
    <condition id="PY32F071CxB">
      <description>Puya PY32F071CxB Devices</description>
      <require Dvendor="Puya:176" Dname="PY32F071C?B*"/>
    </condition>
    <condition id="PY32F072 Series">
      <description>Puya PY32F072 Series</description>
      <require Dvendor="Puya:176" Dname="PY32F072x*"/>
    </condition>
    <condition id="PY32F072x6">
      <description>Puya PY32F072x6 Devices</description>
      <require Dvendor="Puya:176" Dname="PY32F072?6*"/>
    </condition>
    <condition id="PY32F072x8">
      <description>Puya PY32F072x8 Devices</description>
      <require Dvendor="Puya:176" Dname="PY32F072?8*"/>
    </condition>
    <condition id="PY32F072x9">
      <description>Puya PY32F072x9 Devices</description>
      <require Dvendor="Puya:176" Dname="PY32F072?9*"/>
    </condition>
    <condition id="PY32F072xB">
      <description>Puya PY32F072xB Devices</description>
      <require Dvendor="Puya:176" Dname="PY32F072?B*"/>
    </condition>
    <condition id="PY32F072C Series">
      <description>Puya PY32F072 Series</description>
      <require Dvendor="Puya:176" Dname="PY32F072Cx*"/>
    </condition>
    <condition id="PY32F072Cx6">
      <description>Puya PY32F072Cx6 Devices</description>
      <require Dvendor="Puya:176" Dname="PY32F072C?6*"/>
    </condition>
    <condition id="PY32F072Cx8">
      <description>Puya PY32F072Cx8 Devices</description>
      <require Dvendor="Puya:176" Dname="PY32F072C?8*"/>
    </condition>
    <condition id="PY32F072Cx9">
      <description>Puya PY32F072Cx9 Devices</description>
      <require Dvendor="Puya:176" Dname="PY32F072C?9*"/>
    </condition>
    <condition id="PY32F072CxB">
      <description>Puya PY32F072CxB Devices</description>
      <require Dvendor="Puya:176" Dname="PY32F072C?B*"/>
    </condition>
    <condition id="PY32F002Ax5 ARMCC">
      <description>Puya PY32F002Ax5 Devices and ARMCC Compiler</description>
      <require condition="PY32F002Ax5"/>
      <require condition="Compiler ARMCC"/>
    </condition>
    <condition id="PY32F002Bx5 ARMCC">
      <description>Puya PY32F002Bx5 Devices and ARMCC Compiler</description>
      <require condition="PY32F002Bx5"/>
      <require condition="Compiler ARMCC"/>
    </condition>
    <condition id="PY32F002Xx2 ARMCC">
      <description>Puya PY32F002Xx2 Devices and ARMCC Compiler</description>
      <require condition="PY32F002Xx2"/>
      <require condition="Compiler ARMCC"/>
    </condition>
    <condition id="PY32F002Xx4 ARMCC">
      <description>Puya PY32F002Xx4 Devices and ARMCC Compiler</description>
      <require condition="PY32F002Xx4"/>
      <require condition="Compiler ARMCC"/>
    </condition>
