OpenPuya/PY32F0xx_Firmware/Packs/GCC/.pack/Puya/PY32F0xx_DFP/Puya.PY32F0xx_DFP.pdsc
    <condition id="PY32F002Xx5 ARMCC">
      <description>Puya PY32F002Xx5 Devices and ARMCC Compiler</description>
      <require condition="PY32F002Xx5"/>
      <require condition="Compiler ARMCC"/>
    </condition>
    <condition id="PY32F003x4 ARMCC">
      <description>Puya PY32F003x4 Devices and ARMCC Compiler</description>
      <require condition="PY32F003x4"/>
      <require condition="Compiler ARMCC"/>
    </condition>
    <condition id="PY32F003x6 ARMCC">
      <description>Puya PY32F003x6 Devices and ARMCC Compiler</description>
      <require condition="PY32F003x6"/>
      <require condition="Compiler ARMCC"/>
    </condition>
    <condition id="PY32F003x7 ARMCC">
      <description>Puya PY32F003x7 Devices and ARMCC Compiler</description>
      <require condition="PY32F003x7"/>
      <require condition="Compiler ARMCC"/>
    </condition>
    <condition id="PY32F003x8 ARMCC">
      <description>Puya PY32F003x8 Devices and ARMCC Compiler</description>
      <require condition="PY32F003x8"/>
      <require condition="Compiler ARMCC"/>
    </condition>
    <condition id="PY32F030x4 ARMCC">
      <description>Puya PY32F030x4 Devices and ARMCC Compiler</description>
      <require condition="PY32F030x4"/>
      <require condition="Compiler ARMCC"/>
    </condition>
    <condition id="PY32F030x6 ARMCC">
      <description>Puya PY32F030x6 Devices and ARMCC Compiler</description>
      <require condition="PY32F030x6"/>
      <require condition="Compiler ARMCC"/>
    </condition>
    <condition id="PY32F030x7 ARMCC">
      <description>Puya PY32F030x7 Devices and ARMCC Compiler</description>
      <require condition="PY32F030x7"/>
      <require condition="Compiler ARMCC"/>
    </condition>
    <condition id="PY32F030x8 ARMCC">
      <description>Puya PY32F030x8 Devices and ARMCC Compiler</description>
      <require condition="PY32F030x8"/>
      <require condition="Compiler ARMCC"/>
    </condition>
    <condition id="PY32F031x4 ARMCC">
      <description>Puya PY32F031x4 Devices and ARMCC Compiler</description>
      <require condition="PY32F031x4"/>
      <require condition="Compiler ARMCC"/>
    </condition>
    <condition id="PY32F031x6 ARMCC">
      <description>Puya PY32F031x6 Devices and ARMCC Compiler</description>
      <require condition="PY32F031x6"/>
      <require condition="Compiler ARMCC"/>
    </condition>
    <condition id="PY32F031x7 ARMCC">
      <description>Puya PY32F031x7 Devices and ARMCC Compiler</description>
      <require condition="PY32F031x7"/>
      <require condition="Compiler ARMCC"/>
    </condition>
    <condition id="PY32F031x8 ARMCC">
      <description>Puya PY32F031x8 Devices and ARMCC Compiler</description>
      <require condition="PY32F031x8"/>
      <require condition="Compiler ARMCC"/>
    </condition>
    <condition id="PY32F040x6 ARMCC">
      <description>Puya PY32F040x6 Devices and ARMCC Compiler</description>
      <require condition="PY32F040x6"/>
      <require condition="Compiler ARMCC"/>
    </condition>
    <condition id="PY32F040x8 ARMCC">
      <description>Puya PY32F040x8 Devices and ARMCC Compiler</description>
      <require condition="PY32F040x8"/>
      <require condition="Compiler ARMCC"/>
    </condition>
    <condition id="PY32F040x9 ARMCC">
      <description>Puya PY32F040x9 Devices and ARMCC Compiler</description>
      <require condition="PY32F040x9"/>
      <require condition="Compiler ARMCC"/>
    </condition>
    <condition id="PY32F040xB ARMCC">
      <description>Puya PY32F040xB Devices and ARMCC Compiler</description>
      <require condition="PY32F040xB"/>
      <require condition="Compiler ARMCC"/>
    </condition>
    <condition id="PY32F040Cx6 ARMCC">
      <description>Puya PY32F040Cx6 Devices and ARMCC Compiler</description>
      <require condition="PY32F040Cx6"/>
      <require condition="Compiler ARMCC"/>
    </condition>
    <condition id="PY32F040Cx8 ARMCC">
      <description>Puya PY32F040Cx8 Devices and ARMCC Compiler</description>
      <require condition="PY32F040Cx8"/>
      <require condition="Compiler ARMCC"/>
    </condition>
    <condition id="PY32F040Cx9 ARMCC">
      <description>Puya PY32F040Cx9 Devices and ARMCC Compiler</description>
      <require condition="PY32F040Cx9"/>
      <require condition="Compiler ARMCC"/>
    </condition>
    <condition id="PY32F040CxB ARMCC">
      <description>Puya PY32F040CxB Devices and ARMCC Compiler</description>
      <require condition="PY32F040CxB"/>
      <require condition="Compiler ARMCC"/>
    </condition>
    <condition id="PY32F071x6 ARMCC">
      <description>Puya PY32F071x6 Devices and ARMCC Compiler</description>
      <require condition="PY32F071x6"/>
      <require condition="Compiler ARMCC"/>
    </condition>
    <condition id="PY32F071x8 ARMCC">
      <description>Puya PY32F071x8 Devices and ARMCC Compiler</description>
      <require condition="PY32F071x8"/>
      <require condition="Compiler ARMCC"/>
    </condition>
    <condition id="PY32F071x9 ARMCC">
      <description>Puya PY32F071x9 Devices and ARMCC Compiler</description>
      <require condition="PY32F071x9"/>
      <require condition="Compiler ARMCC"/>
    </condition>
    <condition id="PY32F071xB ARMCC">
      <description>Puya PY32F071xB Devices and ARMCC Compiler</description>
      <require condition="PY32F071xB"/>
      <require condition="Compiler ARMCC"/>
    </condition>
    <condition id="PY32F071Cx6 ARMCC">
      <description>Puya PY32F071Cx6 Devices and ARMCC Compiler</description>
      <require condition="PY32F071Cx6"/>
      <require condition="Compiler ARMCC"/>
    </condition>
    <condition id="PY32F071Cx8 ARMCC">
      <description>Puya PY32F071Cx8 Devices and ARMCC Compiler</description>
      <require condition="PY32F071Cx8"/>
      <require condition="Compiler ARMCC"/>
    </condition>
    <condition id="PY32F071Cx9 ARMCC">
      <description>Puya PY32F071Cx9 Devices and ARMCC Compiler</description>
      <require condition="PY32F071Cx9"/>
      <require condition="Compiler ARMCC"/>
    </condition>
    <condition id="PY32F071CxB ARMCC">
      <description>Puya PY32F071CxB Devices and ARMCC Compiler</description>
      <require condition="PY32F071CxB"/>
      <require condition="Compiler ARMCC"/>
    </condition>
    <condition id="PY32F072x6 ARMCC">
      <description>Puya PY32F072x6 Devices and ARMCC Compiler</description>
      <require condition="PY32F072x6"/>
      <require condition="Compiler ARMCC"/>
    </condition>
