OpenPuya/PY32F0xx_Firmware/Packs/GCC/.pack/Puya/PY32F0xx_DFP/Puya.PY32F0xx_DFP.pdsc
    <condition id="PY32F072x8 ARMCC">
      <description>Puya PY32F072x8 Devices and ARMCC Compiler</description>
      <require condition="PY32F072x8"/>
      <require condition="Compiler ARMCC"/>
    </condition>
    <condition id="PY32F072x9 ARMCC">
      <description>Puya PY32F072x9 Devices and ARMCC Compiler</description>
      <require condition="PY32F072x9"/>
      <require condition="Compiler ARMCC"/>
    </condition>
    <condition id="PY32F072xB ARMCC">
      <description>Puya PY32F072xB Devices and ARMCC Compiler</description>
      <require condition="PY32F072xB"/>
      <require condition="Compiler ARMCC"/>
    </condition>
    <condition id="PY32F072Cx6 ARMCC">
      <description>Puya PY32F072Cx6 Devices and ARMCC Compiler</description>
      <require condition="PY32F072Cx6"/>
      <require condition="Compiler ARMCC"/>
    </condition>
    <condition id="PY32F072Cx8 ARMCC">
      <description>Puya PY32F072Cx8 Devices and ARMCC Compiler</description>
      <require condition="PY32F072Cx8"/>
      <require condition="Compiler ARMCC"/>
    </condition>
    <condition id="PY32F072Cx9 ARMCC">
      <description>Puya PY32F072Cx9 Devices and ARMCC Compiler</description>
      <require condition="PY32F072Cx9"/>
      <require condition="Compiler ARMCC"/>
    </condition>
    <condition id="PY32F072CxB ARMCC">
      <description>Puya PY32F072CxB Devices and ARMCC Compiler</description>
      <require condition="PY32F072CxB"/>
      <require condition="Compiler ARMCC"/>
    </condition>
    <condition id="PY32F0xx HAL">
      <accept condition="PY32F002A Series"/>
      <accept condition="PY32F003 Series"/>
      <accept condition="PY32F030 Series"/>
    </condition>
    <condition id="PY32F002B HAL">
      <accept condition="PY32F002B Series"/>
    </condition>
    <condition id="PY32F040 HAL">
      <accept condition="PY32F040 Series"/>
    </condition>
    <condition id="PY32F071 HAL">
      <accept condition="PY32F071 Series"/>
    </condition>
    <condition id="PY32F072 HAL">
      <accept condition="PY32F072 Series"/>
    </condition>

  </conditions>
  <components>
    <bundle Cbundle="PY32F002A LL Start Kit BSP" Cclass="Board Support" Cversion="1.1.4">
      <description>PY32F002A LL Start Kit BSP</description>
      <doc>Drivers/BSP/PY32F002Axx_Start_Kit</doc>
      <component Cgroup="PY32F002A LL Start Kit BSP" Cversion="1.1.4" condition="PY32F002A Series">
        <description>PY32F002A Start Kit Board</description>
        <files>
          <file category="source" name="Drivers/BSP/PY32F002Axx_Start_Kit/py32f002axx_ll_Start_Kit.c"/>
          <file category="header" name="Drivers/BSP/PY32F002Axx_Start_Kit/py32f002axx_ll_Start_Kit.h"/>
        </files>
      </component>
    </bundle>
    <bundle Cbundle="PY32F002A Start Kit BSP" Cclass="Board Support" Cversion="1.1.4" isDefaultVariant="true">
      <description>PY32F002A Start Kit BSP</description>
      <doc>Drivers/BSP/PY32F002Axx_Start_Kit</doc>
      <component Cgroup="PY32F002A Start Kit BSP" Cversion="1.1.4" condition="PY32F002A Series">
        <description>PY32F002A Start Kit Board</description>
        <files>
          <file category="source" name="Drivers/BSP/PY32F002Axx_Start_Kit/py32f002axx_Start_Kit.c"/>
          <file category="header" name="Drivers/BSP/PY32F002Axx_Start_Kit/py32f002axx_Start_Kit.h"/>
        </files>
      </component>
    </bundle>
    <bundle Cbundle="PY32F002B LL Start Kit BSP" Cclass="Board Support" Cversion="0.0.4">
      <description>PY32F002B LL Start Kit BSP</description>
      <doc>Drivers/BSP/Drivers/BSP/PY32F002Bxx_Start_Kit</doc>
      <component Cgroup="PY32F002B LL Start Kit BSP" Cversion="0.0.4" condition="PY32F002B Series">
        <description>PY32F002B Start Kit Board</description>
        <files>
          <file category="source" name="Drivers/BSP/PY32F002Bxx_Start_Kit/py32f002bxx_ll_Start_Kit.c"/>
          <file category="header" name="Drivers/BSP/PY32F002Bxx_Start_Kit/py32f002bxx_ll_Start_Kit.h"/>
        </files>
      </component>
    </bundle>
    <bundle Cbundle="PY32F002B Start Kit BSP" Cclass="Board Support" Cversion="0.0.4" isDefaultVariant="true">
      <description>PY32F002B Start Kit BSP</description>
      <doc>Drivers/BSP/Drivers/BSP/PY32F002Bxx_Start_Kit</doc>
      <component Cgroup="PY32F002B Start Kit BSP" Cversion="0.0.4" condition="PY32F002B Series">
        <description>PY32F002B Start Kit Board</description>
        <files>
          <file category="source" name="Drivers/BSP/PY32F002Bxx_Start_Kit/py32f002bxx_Start_Kit.c"/>
          <file category="header" name="Drivers/BSP/PY32F002Bxx_Start_Kit/py32f002bxx_Start_Kit.h"/>
        </files>
      </component>
    </bundle>
    <bundle Cbundle="PY32F003 LL Start Kit BSP" Cclass="Board Support" Cversion="1.1.4">
      <description>PY32F003 LL Start Kit BSP</description>
      <doc>Drivers/BSP/PY32F003xx_Start_Kit</doc>
      <component Cgroup="PY32F003 LL Start Kit BSP" Cversion="1.1.4" condition="PY32F003 Series">
        <description>PY32F003 Start Kit Board</description>
        <files>
          <file category="source" name="Drivers/BSP/PY32F003xx_Start_Kit/py32f003xx_ll_Start_Kit.c"/>
          <file category="header" name="Drivers/BSP/PY32F003xx_Start_Kit/py32f003xx_ll_Start_Kit.h"/>
        </files>
      </component>
    </bundle>
    <bundle Cbundle="PY32F003 Start Kit BSP" Cclass="Board Support" Cversion="1.1.4" isDefaultVariant="true">
      <description>PY32F003 Start Kit BSP</description>
      <doc>Drivers/BSP/PY32F003xx_Start_Kit</doc>
      <component Cgroup="PY32F003 Start Kit BSP" Cversion="1.1.4" condition="PY32F003 Series">
        <description>PY32F003 Start Kit Board</description>
        <files>
          <file category="source" name="Drivers/BSP/PY32F003xx_Start_Kit/py32f003xx_Start_Kit.c"/>
          <file category="header" name="Drivers/BSP/PY32F003xx_Start_Kit/py32f003xx_Start_Kit.h"/>
        </files>
      </component>
    </bundle>
    <bundle Cbundle="PY32F030 LL Start Kit BSP" Cclass="Board Support" Cversion="1.1.4">
      <description>PY32F030 LL Start Kit BSP</description>
      <doc>Drivers/BSP/PY32F030xx_Start_Kit</doc>
      <component Cgroup="PY32F030 LL Start Kit BSP" Cversion="1.1.4" condition="PY32F030 Series">
        <description>PY32F030 Start Kit Board</description>
        <files>
          <file category="source" name="Drivers/BSP/PY32F030xx_Start_Kit/py32f030xx_ll_Start_Kit.c"/>
          <file category="header" name="Drivers/BSP/PY32F030xx_Start_Kit/py32f030xx_ll_Start_Kit.h"/>
        </files>
      </component>
    </bundle>
    <bundle Cbundle="PY32F030 Start Kit BSP" Cclass="Board Support" Cversion="1.1.4" isDefaultVariant="true">
      <description>PY32F030 Start Kit BSP</description>
      <doc>Drivers/BSP/PY32F030xx_Start_Kit</doc>
      <component Cgroup="PY32F030 Start Kit BSP" Cversion="1.1.4" condition="PY32F030 Series">
        <description>PY32F030 Start Kit Board</description>
        <files>
          <file category="source" name="Drivers/BSP/PY32F030xx_Start_Kit/py32f030xx_Start_Kit.c"/>
          <file category="header" name="Drivers/BSP/PY32F030xx_Start_Kit/py32f030xx_Start_Kit.h"/>
        </files>
      </component>
    </bundle>
    <bundle Cbundle="PY32F040 LL Start Kit BSP" Cclass="Board Support" Cversion="0.0.4">
      <description>PY32F040 LL Start Kit BSP</description>
      <doc>Drivers/BSP/PY32F040xx_Start_Kit</doc>
      <component Cgroup="PY32F040 LL Start Kit BSP" Cversion="0.0.4" condition="PY32F040 Series">
        <description>PY32F040 Start Kit Board</description>
        <files>
          <file category="source" name="Drivers/BSP/PY32F040xx_Start_Kit/py32f040xx_ll_Start_Kit.c"/>
          <file category="header" name="Drivers/BSP/PY32F040xx_Start_Kit/py32f040xx_ll_Start_Kit.h"/>
        </files>
      </component>
    </bundle>
    <bundle Cbundle="PY32F040 Start Kit BSP" Cclass="Board Support" Cversion="0.0.4" isDefaultVariant="true">
      <description>PY32F040 Start Kit BSP</description>
      <doc>Drivers/BSP/PY32F040xx_Start_Kit</doc>
      <component Cgroup="PY32F040 Start Kit BSP" Cversion="0.0.4" condition="PY32F040 Series">
        <description>PY32F040 Start Kit Board</description>
        <files>
          <file category="source" name="Drivers/BSP/PY32F040xx_Start_Kit/py32f040xx_Start_Kit.c"/>
          <file category="header" name="Drivers/BSP/PY32F040xx_Start_Kit/py32f040xx_Start_Kit.h"/>
        </files>
      </component>
    </bundle>
    <bundle Cbundle="PY32F071 LL Start Kit BSP" Cclass="Board Support" Cversion="0.0.3">
      <description>PY32F071 LL Start Kit BSP</description>
      <doc>Drivers/BSP/PY32F071xx_Start_Kit</doc>
      <component Cgroup="PY32F071 LL Start Kit BSP" Cversion="0.0.3" condition="PY32F071 Series">
        <description>PY32F071 Start Kit Board</description>
        <files>
          <file category="source" name="Drivers/BSP/PY32F071xx_Start_Kit/py32f071xx_ll_Start_Kit.c"/>
          <file category="header" name="Drivers/BSP/PY32F071xx_Start_Kit/py32f071xx_ll_Start_Kit.h"/>
        </files>
      </component>
    </bundle>
    <bundle Cbundle="PY32F071 Start Kit BSP" Cclass="Board Support" Cversion="0.0.3" isDefaultVariant="true">
      <description>PY32F071 Start Kit BSP</description>
      <doc>Drivers/BSP/PY32F071xx_Start_Kit</doc>
      <component Cgroup="PY32F071 Start Kit BSP" Cversion="0.0.3" condition="PY32F071 Series">
        <description>PY32F071 Start Kit Board</description>
        <files>
          <file category="source" name="Drivers/BSP/PY32F071xx_Start_Kit/py32f071xx_Start_Kit.c"/>
          <file category="header" name="Drivers/BSP/PY32F071xx_Start_Kit/py32f071xx_Start_Kit.h"/>
        </files>
      </component>
    </bundle>
    <bundle Cbundle="PY32F072 LL Start Kit BSP" Cclass="Board Support" Cversion="0.0.3">
      <description>PY32F072 LL Start Kit BSP</description>
      <doc>Drivers/BSP/PY32F072xx_Start_Kit</doc>
      <component Cgroup="PY32F072 LL Start Kit BSP" Cversion="0.0.3" condition="PY32F072 Series">
        <description>PY32F072 Start Kit Board</description>
        <files>
          <file category="source" name="Drivers/BSP/PY32F072xx_Start_Kit/py32f072xx_ll_Start_Kit.c"/>
          <file category="header" name="Drivers/BSP/PY32F072xx_Start_Kit/py32f072xx_ll_Start_Kit.h"/>
        </files>
      </component>
    </bundle>
    <bundle Cbundle="PY32F072 Start Kit BSP" Cclass="Board Support" Cversion="0.0.3" isDefaultVariant="true">
      <description>PY32F072 Start Kit BSP</description>
      <doc>Drivers/BSP/PY32F072xx_Start_Kit</doc>
      <component Cgroup="PY32F072 Start Kit BSP" Cversion="0.0.3" condition="PY32F072 Series">
        <description>PY32F072 Start Kit Board</description>
        <files>
          <file category="source" name="Drivers/BSP/PY32F072xx_Start_Kit/py32f072xx_Start_Kit.c"/>
          <file category="header" name="Drivers/BSP/PY32F072xx_Start_Kit/py32f072xx_Start_Kit.h"/>
        </files>
      </component>
    </bundle>

    <bundle Cbundle="Full HAL and LL Drivers" Cclass="Drivers" Cversion="1.1.5" isDefaultVariant="true">
      <description>Full HAL and LL Drivers</description>
      <doc>Drivers</doc>
      <component Cgroup="PY32F0xx HAL Driver" Cversion="1.1.5" condition="PY32F0xx HAL">
        <description>PY32F0xx HAL Drivers for PY32F002A,PY32F003,PY32F030 Series</description>
        <Pre_Include_Global_h>
#define USE_HAL_DRIVER
#define USE_FULL_LL_DRIVER
        </Pre_Include_Global_h>
        <files>
          <file category="include" name="Drivers/PY32F0xx_HAL_Driver/Inc/"/>
          <file category="source" name="Drivers/PY32F0xx_HAL_Driver/Src/py32f0xx_hal.c"/>
          <file category="source" name="Drivers/PY32F0xx_HAL_Driver/Src/py32f0xx_hal_adc.c"/>
          <file category="source" name="Drivers/PY32F0xx_HAL_Driver/Src/py32f0xx_hal_comp.c"/>
          <file category="source" name="Drivers/PY32F0xx_HAL_Driver/Src/py32f0xx_hal_cortex.c"/>
          <file category="source" name="Drivers/PY32F0xx_HAL_Driver/Src/py32f0xx_hal_crc.c"/>
          <file category="source" name="Drivers/PY32F0xx_HAL_Driver/Src/py32f0xx_hal_dma.c"/>
          <file category="source" name="Drivers/PY32F0xx_HAL_Driver/Src/py32f0xx_hal_exti.c"/>
          <file category="source" name="Drivers/PY32F0xx_HAL_Driver/Src/py32f0xx_hal_flash.c"/>
          <file category="source" name="Drivers/PY32F0xx_HAL_Driver/Src/py32f0xx_hal_gpio.c"/>
          <file category="source" name="Drivers/PY32F0xx_HAL_Driver/Src/py32f0xx_hal_i2c.c"/>
          <file category="source" name="Drivers/PY32F0xx_HAL_Driver/Src/py32f0xx_hal_irda.c"/>
          <file category="source" name="Drivers/PY32F0xx_HAL_Driver/Src/py32f0xx_hal_iwdg.c"/>
          <file category="source" name="Drivers/PY32F0xx_HAL_Driver/Src/py32f0xx_hal_led.c"/>
          <file category="source" name="Drivers/PY32F0xx_HAL_Driver/Src/py32f0xx_hal_lptim.c"/>
          <file category="source" name="Drivers/PY32F0xx_HAL_Driver/Src/py32f0xx_hal_pwr.c"/>
          <file category="source" name="Drivers/PY32F0xx_HAL_Driver/Src/py32f0xx_hal_rcc.c"/>
          <file category="source" name="Drivers/PY32F0xx_HAL_Driver/Src/py32f0xx_hal_rcc_ex.c"/>
          <file category="source" name="Drivers/PY32F0xx_HAL_Driver/Src/py32f0xx_hal_rtc.c"/>
          <file category="source" name="Drivers/PY32F0xx_HAL_Driver/Src/py32f0xx_hal_rtc_ex.c"/>
          <file category="source" name="Drivers/PY32F0xx_HAL_Driver/Src/py32f0xx_hal_spi.c"/>
          <file category="source" name="Drivers/PY32F0xx_HAL_Driver/Src/py32f0xx_hal_tim.c"/>
          <file category="source" name="Drivers/PY32F0xx_HAL_Driver/Src/py32f0xx_hal_tim_ex.c"/>
          <file category="source" name="Drivers/PY32F0xx_HAL_Driver/Src/py32f0xx_hal_uart.c"/>
          <file category="source" name="Drivers/PY32F0xx_HAL_Driver/Src/py32f0xx_hal_usart.c"/>
          <file category="source" name="Drivers/PY32F0xx_HAL_Driver/Src/py32f0xx_hal_wwdg.c"/>

