OpenPuya/PY32F0xx_Firmware/Packs/GCC/.pack/Puya/PY32F0xx_DFP/Puya.PY32F0xx_DFP.pdsc
          <file category="source" name="Drivers/PY32F0xx_HAL_Driver/Src/py32f0xx_ll_adc.c"/>
          <file category="source" name="Drivers/PY32F0xx_HAL_Driver/Src/py32f0xx_ll_comp.c"/>
          <file category="source" name="Drivers/PY32F0xx_HAL_Driver/Src/py32f0xx_ll_crc.c"/>
          <file category="source" name="Drivers/PY32F0xx_HAL_Driver/Src/py32f0xx_ll_dma.c"/>
          <file category="source" name="Drivers/PY32F0xx_HAL_Driver/Src/py32f0xx_ll_exti.c"/>
          <file category="source" name="Drivers/PY32F0xx_HAL_Driver/Src/py32f0xx_ll_gpio.c"/>
          <file category="source" name="Drivers/PY32F0xx_HAL_Driver/Src/py32f0xx_ll_i2c.c"/>
          <file category="source" name="Drivers/PY32F0xx_HAL_Driver/Src/py32f0xx_ll_led.c"/>
          <file category="source" name="Drivers/PY32F0xx_HAL_Driver/Src/py32f0xx_ll_lptim.c"/>
          <file category="source" name="Drivers/PY32F0xx_HAL_Driver/Src/py32f0xx_ll_pwr.c"/>
          <file category="source" name="Drivers/PY32F0xx_HAL_Driver/Src/py32f0xx_ll_rcc.c"/>
          <file category="source" name="Drivers/PY32F0xx_HAL_Driver/Src/py32f0xx_ll_rtc.c"/>
          <file category="source" name="Drivers/PY32F0xx_HAL_Driver/Src/py32f0xx_ll_spi.c"/>
          <file category="source" name="Drivers/PY32F0xx_HAL_Driver/Src/py32f0xx_ll_tim.c"/>
          <file category="source" name="Drivers/PY32F0xx_HAL_Driver/Src/py32f0xx_ll_usart.c"/>
          <file category="source" name="Drivers/PY32F0xx_HAL_Driver/Src/py32f0xx_ll_utils.c"/>

          <file category="header" name="MDK/Templates/PY32F002A/Inc/py32f0xx_hal_conf.h" attr="config" version="1.1.5"/>
        </files>
      </component>
      <component Cgroup="PY32F002B HAL Driver" Cversion="0.0.5" condition="PY32F002B HAL">
        <description>PY32F002B HAL Drivers for PY32F002B Series</description>
        <Pre_Include_Global_h>
#define USE_HAL_DRIVER
#define USE_FULL_LL_DRIVER
        </Pre_Include_Global_h>
        <files>
          <file category="include" name="Drivers/PY32F002B_HAL_Driver/Inc/"/>
          <file category="source" name="Drivers/PY32F002B_HAL_Driver/Src/py32f002b_hal.c"/>
          <file category="source" name="Drivers/PY32F002B_HAL_Driver/Src/py32f002b_hal_adc.c"/>
          <file category="source" name="Drivers/PY32F002B_HAL_Driver/Src/py32f002b_hal_comp.c"/>
          <file category="source" name="Drivers/PY32F002B_HAL_Driver/Src/py32f002b_hal_cortex.c"/>
          <file category="source" name="Drivers/PY32F002B_HAL_Driver/Src/py32f002b_hal_crc.c"/>
          <file category="source" name="Drivers/PY32F002B_HAL_Driver/Src/py32f002b_hal_exti.c"/>
          <file category="source" name="Drivers/PY32F002B_HAL_Driver/Src/py32f002b_hal_flash.c"/>
          <file category="source" name="Drivers/PY32F002B_HAL_Driver/Src/py32f002b_hal_gpio.c"/>
          <file category="source" name="Drivers/PY32F002B_HAL_Driver/Src/py32f002b_hal_i2c.c"/>
          <file category="source" name="Drivers/PY32F002B_HAL_Driver/Src/py32f002b_hal_iwdg.c"/>
          <file category="source" name="Drivers/PY32F002B_HAL_Driver/Src/py32f002b_hal_lptim.c"/>
          <file category="source" name="Drivers/PY32F002B_HAL_Driver/Src/py32f002b_hal_pwr.c"/>
          <file category="source" name="Drivers/PY32F002B_HAL_Driver/Src/py32f002b_hal_rcc.c"/>
          <file category="source" name="Drivers/PY32F002B_HAL_Driver/Src/py32f002b_hal_rcc_ex.c"/>
          <file category="source" name="Drivers/PY32F002B_HAL_Driver/Src/py32f002b_hal_spi.c"/>
          <file category="source" name="Drivers/PY32F002B_HAL_Driver/Src/py32f002b_hal_tim.c"/>
          <file category="source" name="Drivers/PY32F002B_HAL_Driver/Src/py32f002b_hal_tim_ex.c"/>
          <file category="source" name="Drivers/PY32F002B_HAL_Driver/Src/py32f002b_hal_uart.c"/>
          <file category="source" name="Drivers/PY32F002B_HAL_Driver/Src/py32f002b_hal_usart.c"/>

          <file category="source" name="Drivers/PY32F002B_HAL_Driver/Src/py32f002b_ll_adc.c"/>
          <file category="source" name="Drivers/PY32F002B_HAL_Driver/Src/py32f002b_ll_comp.c"/>
          <file category="source" name="Drivers/PY32F002B_HAL_Driver/Src/py32f002b_ll_crc.c"/>
          <file category="source" name="Drivers/PY32F002B_HAL_Driver/Src/py32f002b_ll_exti.c"/>
          <file category="source" name="Drivers/PY32F002B_HAL_Driver/Src/py32f002b_ll_gpio.c"/>
          <file category="source" name="Drivers/PY32F002B_HAL_Driver/Src/py32f002b_ll_i2c.c"/>
          <file category="source" name="Drivers/PY32F002B_HAL_Driver/Src/py32f002b_ll_lptim.c"/>
          <file category="source" name="Drivers/PY32F002B_HAL_Driver/Src/py32f002b_ll_pwr.c"/>
          <file category="source" name="Drivers/PY32F002B_HAL_Driver/Src/py32f002b_ll_rcc.c"/>
          <file category="source" name="Drivers/PY32F002B_HAL_Driver/Src/py32f002b_ll_spi.c"/>
          <file category="source" name="Drivers/PY32F002B_HAL_Driver/Src/py32f002b_ll_tim.c"/>
          <file category="source" name="Drivers/PY32F002B_HAL_Driver/Src/py32f002b_ll_usart.c"/>
          <file category="source" name="Drivers/PY32F002B_HAL_Driver/Src/py32f002b_ll_utils.c"/>
        </files>
      </component>
      <component Cgroup="PY32F040 HAL Driver" Cversion="0.0.5" condition="PY32F040 HAL">
        <description>PY32F040 HAL Drivers for PY32F040 Series</description>
        <Pre_Include_Global_h>
#define USE_HAL_DRIVER
#define USE_FULL_LL_DRIVER
        </Pre_Include_Global_h>
        <files>
          <file category="include" name="Drivers/PY32F040_HAL_Driver/Inc/"/>
          <file category="source" name="Drivers/PY32F040_HAL_Driver/Src/py32f040_hal.c"/>
          <file category="source" name="Drivers/PY32F040_HAL_Driver/Src/py32f040_hal_adc.c"/>
          <file category="source" name="Drivers/PY32F040_HAL_Driver/Src/py32f040_hal_adc_ex.c"/>
          <file category="source" name="Drivers/PY32F040_HAL_Driver/Src/py32f040_hal_comp.c"/>
          <file category="source" name="Drivers/PY32F040_HAL_Driver/Src/py32f040_hal_cortex.c"/>
          <file category="source" name="Drivers/PY32F040_HAL_Driver/Src/py32f040_hal_crc.c"/>
          <file category="source" name="Drivers/PY32F040_HAL_Driver/Src/py32f040_hal_ctc.c"/>
          <file category="source" name="Drivers/PY32F040_HAL_Driver/Src/py32f040_hal_div.c"/>
          <file category="source" name="Drivers/PY32F040_HAL_Driver/Src/py32f040_hal_dma.c"/>
          <file category="source" name="Drivers/PY32F040_HAL_Driver/Src/py32f040_hal_exti.c"/>
          <file category="source" name="Drivers/PY32F040_HAL_Driver/Src/py32f040_hal_flash.c"/>
          <file category="source" name="Drivers/PY32F040_HAL_Driver/Src/py32f040_hal_gpio.c"/>
          <file category="source" name="Drivers/PY32F040_HAL_Driver/Src/py32f040_hal_i2c.c"/>
          <file category="source" name="Drivers/PY32F040_HAL_Driver/Src/py32f040_hal_i2s.c"/>
          <file category="source" name="Drivers/PY32F040_HAL_Driver/Src/py32f040_hal_irda.c"/>
          <file category="source" name="Drivers/PY32F040_HAL_Driver/Src/py32f040_hal_iwdg.c"/>
          <file category="source" name="Drivers/PY32F040_HAL_Driver/Src/py32f040_hal_lcd.c"/>
          <file category="source" name="Drivers/PY32F040_HAL_Driver/Src/py32f040_hal_lptim.c"/>
          <file category="source" name="Drivers/PY32F040_HAL_Driver/Src/py32f040_hal_pwr.c"/>
          <file category="source" name="Drivers/PY32F040_HAL_Driver/Src/py32f040_hal_rcc.c"/>
          <file category="source" name="Drivers/PY32F040_HAL_Driver/Src/py32f040_hal_rcc_ex.c"/>
          <file category="source" name="Drivers/PY32F040_HAL_Driver/Src/py32f040_hal_rtc.c"/>
          <file category="source" name="Drivers/PY32F040_HAL_Driver/Src/py32f040_hal_rtc_ex.c"/>
          <file category="source" name="Drivers/PY32F040_HAL_Driver/Src/py32f040_hal_smartcard.c"/>
          <file category="source" name="Drivers/PY32F040_HAL_Driver/Src/py32f040_hal_spi.c"/>
          <file category="source" name="Drivers/PY32F040_HAL_Driver/Src/py32f040_hal_tim.c"/>
          <file category="source" name="Drivers/PY32F040_HAL_Driver/Src/py32f040_hal_tim_ex.c"/>
          <file category="source" name="Drivers/PY32F040_HAL_Driver/Src/py32f040_hal_uart.c"/>
          <file category="source" name="Drivers/PY32F040_HAL_Driver/Src/py32f040_hal_usart.c"/>
          <file category="source" name="Drivers/PY32F040_HAL_Driver/Src/py32f040_hal_wwdg.c"/>

          <file category="source" name="Drivers/PY32F040_HAL_Driver/Src/py32f040_ll_adc.c"/>
          <file category="source" name="Drivers/PY32F040_HAL_Driver/Src/py32f040_ll_comp.c"/>
          <file category="source" name="Drivers/PY32F040_HAL_Driver/Src/py32f040_ll_crc.c"/>
          <file category="source" name="Drivers/PY32F040_HAL_Driver/Src/py32f040_ll_ctc.c"/>
          <file category="source" name="Drivers/PY32F040_HAL_Driver/Src/py32f040_ll_dma.c"/>
          <file category="source" name="Drivers/PY32F040_HAL_Driver/Src/py32f040_ll_exti.c"/>
          <file category="source" name="Drivers/PY32F040_HAL_Driver/Src/py32f040_ll_gpio.c"/>
          <file category="source" name="Drivers/PY32F040_HAL_Driver/Src/py32f040_ll_i2c.c"/>
          <file category="source" name="Drivers/PY32F040_HAL_Driver/Src/py32f040_ll_lcd.c"/>
          <file category="source" name="Drivers/PY32F040_HAL_Driver/Src/py32f040_ll_lptim.c"/>
          <file category="source" name="Drivers/PY32F040_HAL_Driver/Src/py32f040_ll_pwr.c"/>
          <file category="source" name="Drivers/PY32F040_HAL_Driver/Src/py32f040_ll_rcc.c"/>
          <file category="source" name="Drivers/PY32F040_HAL_Driver/Src/py32f040_ll_rtc.c"/>
          <file category="source" name="Drivers/PY32F040_HAL_Driver/Src/py32f040_ll_spi.c"/>
          <file category="source" name="Drivers/PY32F040_HAL_Driver/Src/py32f040_ll_tim.c"/>
          <file category="source" name="Drivers/PY32F040_HAL_Driver/Src/py32f040_ll_usart.c"/>
          <file category="source" name="Drivers/PY32F040_HAL_Driver/Src/py32f040_ll_utils.c"/>
        </files>
      </component>
      <component Cgroup="PY32F071 HAL Driver" Cversion="0.0.5" condition="PY32F071 HAL">
        <description>PY32F071 HAL Drivers for PY32F071 Series</description>
        <Pre_Include_Global_h>
#define USE_HAL_DRIVER
#define USE_FULL_LL_DRIVER
        </Pre_Include_Global_h>
        <files>
          <file category="include" name="Drivers/PY32F071_HAL_Driver/Inc/"/>
          <file category="source" name="Drivers/PY32F071_HAL_Driver/Src/py32f071_hal.c"/>
          <file category="source" name="Drivers/PY32F071_HAL_Driver/Src/py32f071_hal_adc.c"/>
          <file category="source" name="Drivers/PY32F071_HAL_Driver/Src/py32f071_hal_adc_ex.c"/>
          <file category="source" name="Drivers/PY32F071_HAL_Driver/Src/py32f071_hal_comp.c"/>
          <file category="source" name="Drivers/PY32F071_HAL_Driver/Src/py32f071_hal_cortex.c"/>
          <file category="source" name="Drivers/PY32F071_HAL_Driver/Src/py32f071_hal_crc.c"/>
          <file category="source" name="Drivers/PY32F071_HAL_Driver/Src/py32f071_hal_ctc.c"/>
          <file category="source" name="Drivers/PY32F071_HAL_Driver/Src/py32f071_hal_dac.c"/>
          <file category="source" name="Drivers/PY32F071_HAL_Driver/Src/py32f071_hal_dac_ex.c"/>
          <file category="source" name="Drivers/PY32F071_HAL_Driver/Src/py32f071_hal_div.c"/>
          <file category="source" name="Drivers/PY32F071_HAL_Driver/Src/py32f071_hal_dma.c"/>
          <file category="source" name="Drivers/PY32F071_HAL_Driver/Src/py32f071_hal_exti.c"/>
          <file category="source" name="Drivers/PY32F071_HAL_Driver/Src/py32f071_hal_flash.c"/>
          <file category="source" name="Drivers/PY32F071_HAL_Driver/Src/py32f071_hal_gpio.c"/>
          <file category="source" name="Drivers/PY32F071_HAL_Driver/Src/py32f071_hal_i2c.c"/>
          <file category="source" name="Drivers/PY32F071_HAL_Driver/Src/py32f071_hal_i2s.c"/>
          <file category="source" name="Drivers/PY32F071_HAL_Driver/Src/py32f071_hal_irda.c"/>
          <file category="source" name="Drivers/PY32F071_HAL_Driver/Src/py32f071_hal_iwdg.c"/>
          <file category="source" name="Drivers/PY32F071_HAL_Driver/Src/py32f071_hal_lcd.c"/>
          <file category="source" name="Drivers/PY32F071_HAL_Driver/Src/py32f071_hal_lptim.c"/>
          <file category="source" name="Drivers/PY32F071_HAL_Driver/Src/py32f071_hal_opa.c"/>
          <file category="source" name="Drivers/PY32F071_HAL_Driver/Src/py32f071_hal_opa_ex.c"/>
          <file category="source" name="Drivers/PY32F071_HAL_Driver/Src/py32f071_hal_pwr.c"/>
          <file category="source" name="Drivers/PY32F071_HAL_Driver/Src/py32f071_hal_rcc.c"/>
          <file category="source" name="Drivers/PY32F071_HAL_Driver/Src/py32f071_hal_rcc_ex.c"/>
          <file category="source" name="Drivers/PY32F071_HAL_Driver/Src/py32f071_hal_rtc.c"/>
          <file category="source" name="Drivers/PY32F071_HAL_Driver/Src/py32f071_hal_rtc_ex.c"/>
          <file category="source" name="Drivers/PY32F071_HAL_Driver/Src/py32f071_hal_smartcard.c"/>
          <file category="source" name="Drivers/PY32F071_HAL_Driver/Src/py32f071_hal_spi.c"/>
          <file category="source" name="Drivers/PY32F071_HAL_Driver/Src/py32f071_hal_tim.c"/>
          <file category="source" name="Drivers/PY32F071_HAL_Driver/Src/py32f071_hal_tim_ex.c"/>
          <file category="source" name="Drivers/PY32F071_HAL_Driver/Src/py32f071_hal_uart.c"/>
          <file category="source" name="Drivers/PY32F071_HAL_Driver/Src/py32f071_hal_usart.c"/>
          <file category="source" name="Drivers/PY32F071_HAL_Driver/Src/py32f071_hal_wwdg.c"/>

          <file category="source" name="Drivers/PY32F071_HAL_Driver/Src/py32f071_ll_adc.c"/>
          <file category="source" name="Drivers/PY32F071_HAL_Driver/Src/py32f071_ll_comp.c"/>
          <file category="source" name="Drivers/PY32F071_HAL_Driver/Src/py32f071_ll_crc.c"/>
          <file category="source" name="Drivers/PY32F071_HAL_Driver/Src/py32f071_ll_ctc.c"/>
          <file category="source" name="Drivers/PY32F071_HAL_Driver/Src/py32f071_ll_dac.c"/>
          <file category="source" name="Drivers/PY32F071_HAL_Driver/Src/py32f071_ll_dma.c"/>
          <file category="source" name="Drivers/PY32F071_HAL_Driver/Src/py32f071_ll_exti.c"/>
          <file category="source" name="Drivers/PY32F071_HAL_Driver/Src/py32f071_ll_gpio.c"/>
          <file category="source" name="Drivers/PY32F071_HAL_Driver/Src/py32f071_ll_i2c.c"/>
          <file category="source" name="Drivers/PY32F071_HAL_Driver/Src/py32f071_ll_lcd.c"/>
          <file category="source" name="Drivers/PY32F071_HAL_Driver/Src/py32f071_ll_lptim.c"/>
          <file category="source" name="Drivers/PY32F071_HAL_Driver/Src/py32f071_ll_pwr.c"/>
          <file category="source" name="Drivers/PY32F071_HAL_Driver/Src/py32f071_ll_rcc.c"/>
          <file category="source" name="Drivers/PY32F071_HAL_Driver/Src/py32f071_ll_rtc.c"/>
          <file category="source" name="Drivers/PY32F071_HAL_Driver/Src/py32f071_ll_spi.c"/>
          <file category="source" name="Drivers/PY32F071_HAL_Driver/Src/py32f071_ll_tim.c"/>
          <file category="source" name="Drivers/PY32F071_HAL_Driver/Src/py32f071_ll_usart.c"/>
          <file category="source" name="Drivers/PY32F071_HAL_Driver/Src/py32f071_ll_utils.c"/>
        </files>
      </component>
      <component Cgroup="PY32F072 HAL Driver" Cversion="0.0.5" condition="PY32F072 HAL">
        <description>PY32F072 HAL Drivers for PY32F072 Series</description>
        <Pre_Include_Global_h>
#define USE_HAL_DRIVER
#define USE_FULL_LL_DRIVER
        </Pre_Include_Global_h>
        <files>
          <file category="include" name="Drivers/PY32F072_HAL_Driver/Inc/"/>
          <file category="source" name="Drivers/PY32F072_HAL_Driver/Src/py32f072_hal.c"/>
          <file category="source" name="Drivers/PY32F072_HAL_Driver/Src/py32f072_hal_adc.c"/>
          <file category="source" name="Drivers/PY32F072_HAL_Driver/Src/py32f072_hal_adc_ex.c"/>
          <file category="source" name="Drivers/PY32F072_HAL_Driver/Src/py32f072_hal_comp.c"/>
          <file category="source" name="Drivers/PY32F072_HAL_Driver/Src/py32f072_hal_cortex.c"/>
          <file category="source" name="Drivers/PY32F072_HAL_Driver/Src/py32f072_hal_crc.c"/>
          <file category="source" name="Drivers/PY32F072_HAL_Driver/Src/py32f072_hal_ctc.c"/>
          <file category="source" name="Drivers/PY32F072_HAL_Driver/Src/py32f072_hal_dac.c"/>
          <file category="source" name="Drivers/PY32F072_HAL_Driver/Src/py32f072_hal_dac_ex.c"/>
          <file category="source" name="Drivers/PY32F072_HAL_Driver/Src/py32f072_hal_div.c"/>
          <file category="source" name="Drivers/PY32F072_HAL_Driver/Src/py32f072_hal_dma.c"/>
          <file category="source" name="Drivers/PY32F072_HAL_Driver/Src/py32f072_hal_exti.c"/>
          <file category="source" name="Drivers/PY32F072_HAL_Driver/Src/py32f072_hal_flash.c"/>
          <file category="source" name="Drivers/PY32F072_HAL_Driver/Src/py32f072_hal_gpio.c"/>
          <file category="source" name="Drivers/PY32F072_HAL_Driver/Src/py32f072_hal_i2c.c"/>
          <file category="source" name="Drivers/PY32F072_HAL_Driver/Src/py32f072_hal_i2s.c"/>
          <file category="source" name="Drivers/PY32F072_HAL_Driver/Src/py32f072_hal_irda.c"/>
          <file category="source" name="Drivers/PY32F072_HAL_Driver/Src/py32f072_hal_iwdg.c"/>
          <file category="source" name="Drivers/PY32F072_HAL_Driver/Src/py32f072_hal_lcd.c"/>
          <file category="source" name="Drivers/PY32F072_HAL_Driver/Src/py32f072_hal_lptim.c"/>
          <file category="source" name="Drivers/PY32F072_HAL_Driver/Src/py32f072_hal_opa.c"/>
          <file category="source" name="Drivers/PY32F072_HAL_Driver/Src/py32f072_hal_opa_ex.c"/>
          <file category="source" name="Drivers/PY32F072_HAL_Driver/Src/py32f072_hal_pwr.c"/>
          <file category="source" name="Drivers/PY32F072_HAL_Driver/Src/py32f072_hal_rcc.c"/>
          <file category="source" name="Drivers/PY32F072_HAL_Driver/Src/py32f072_hal_rcc_ex.c"/>
          <file category="source" name="Drivers/PY32F072_HAL_Driver/Src/py32f072_hal_rtc.c"/>
          <file category="source" name="Drivers/PY32F072_HAL_Driver/Src/py32f072_hal_rtc_ex.c"/>
          <file category="source" name="Drivers/PY32F072_HAL_Driver/Src/py32f072_hal_smartcard.c"/>
          <file category="source" name="Drivers/PY32F072_HAL_Driver/Src/py32f072_hal_spi.c"/>
          <file category="source" name="Drivers/PY32F072_HAL_Driver/Src/py32f072_hal_tim.c"/>
          <file category="source" name="Drivers/PY32F072_HAL_Driver/Src/py32f072_hal_tim_ex.c"/>
          <file category="source" name="Drivers/PY32F072_HAL_Driver/Src/py32f072_hal_uart.c"/>
          <file category="source" name="Drivers/PY32F072_HAL_Driver/Src/py32f072_hal_usart.c"/>
          <file category="source" name="Drivers/PY32F072_HAL_Driver/Src/py32f072_hal_wwdg.c"/>

          <file category="source" name="Drivers/PY32F072_HAL_Driver/Src/py32f072_ll_adc.c"/>
          <file category="source" name="Drivers/PY32F072_HAL_Driver/Src/py32f072_ll_comp.c"/>
          <file category="source" name="Drivers/PY32F072_HAL_Driver/Src/py32f072_ll_crc.c"/>
          <file category="source" name="Drivers/PY32F072_HAL_Driver/Src/py32f072_ll_ctc.c"/>
          <file category="source" name="Drivers/PY32F072_HAL_Driver/Src/py32f072_ll_dac.c"/>
          <file category="source" name="Drivers/PY32F072_HAL_Driver/Src/py32f072_ll_dma.c"/>
          <file category="source" name="Drivers/PY32F072_HAL_Driver/Src/py32f072_ll_exti.c"/>
          <file category="source" name="Drivers/PY32F072_HAL_Driver/Src/py32f072_ll_gpio.c"/>
          <file category="source" name="Drivers/PY32F072_HAL_Driver/Src/py32f072_ll_i2c.c"/>
          <file category="source" name="Drivers/PY32F072_HAL_Driver/Src/py32f072_ll_lcd.c"/>
          <file category="source" name="Drivers/PY32F072_HAL_Driver/Src/py32f072_ll_lptim.c"/>
          <file category="source" name="Drivers/PY32F072_HAL_Driver/Src/py32f072_ll_pwr.c"/>
          <file category="source" name="Drivers/PY32F072_HAL_Driver/Src/py32f072_ll_rcc.c"/>
          <file category="source" name="Drivers/PY32F072_HAL_Driver/Src/py32f072_ll_rtc.c"/>
          <file category="source" name="Drivers/PY32F072_HAL_Driver/Src/py32f072_ll_spi.c"/>
          <file category="source" name="Drivers/PY32F072_HAL_Driver/Src/py32f072_ll_tim.c"/>
          <file category="source" name="Drivers/PY32F072_HAL_Driver/Src/py32f072_ll_usart.c"/>
          <file category="source" name="Drivers/PY32F072_HAL_Driver/Src/py32f072_ll_utils.c"/>
        </files>
      </component>
    </bundle>

