OpenPuya/PY32F0xx_Firmware/Packs/GCC/.pack/Puya/PY32F0xx_DFP/Puya.PY32F0xx_DFP.pdsc
    <bundle Cbundle="PY32F0xx Standalone" Cclass="Drivers" Cversion="1.1.5">
      <description>PY32F0xx Standalone Drivers</description>
      <doc>Drivers/PY32F0xx_HAL_Driver</doc>
      <component Cgroup="PY32F0xx HAL Driver" Csub="COMMON" condition="PY32F0xx HAL">
      <description>COMMON Module</description>
        <Pre_Include_Global_h>
#define USE_HAL_DRIVER
#define USE_FULL_LL_DRIVER
        </Pre_Include_Global_h>
        <files>
          <file category="include" name="Drivers/PY32F0xx_HAL_Driver/Inc/"/>
          <file category="source" name="Drivers/PY32F0xx_HAL_Driver/Src/py32f0xx_hal.c"/>
          <file category="header" name="MDK/Templates/PY32F002A/Inc/py32f0xx_hal_conf.h" attr="config" version="1.1.5"/>
        </files>
      </component>
      <component Cgroup="PY32F0xx HAL Driver" Csub="ADC" condition="PY32F0xx HAL">
        <description>ADC Module</description>
        <files>
          <file category="source" name="Drivers/PY32F0xx_HAL_Driver/Src/py32f0xx_hal_adc.c"/>
        </files>
      </component>
      <component Cgroup="PY32F0xx HAL Driver" Csub="COMP" condition="PY32F0xx HAL">
        <description>COMP Module</description>
        <files>
          <file category="source" name="Drivers/PY32F0xx_HAL_Driver/Src/py32f0xx_hal_comp.c"/>
        </files>
      </component>
      <component Cgroup="PY32F0xx HAL Driver" Csub="CORTEX" condition="PY32F0xx HAL">
        <description>CORTEX Module</description>
        <files>
          <file category="source" name="Drivers/PY32F0xx_HAL_Driver/Src/py32f0xx_hal_cortex.c"/>
        </files>
      </component>
      <component Cgroup="PY32F0xx HAL Driver" Csub="CRC" condition="PY32F0xx HAL">
        <description>CRC Module</description>
        <files>
          <file category="source" name="Drivers/PY32F0xx_HAL_Driver/Src/py32f0xx_hal_crc.c"/>
        </files>
      </component>
      <component Cgroup="PY32F0xx HAL Driver" Csub="DMA" condition="PY32F0xx HAL">
        <description>DMA Module</description>
        <files>
          <file category="source" name="Drivers/PY32F0xx_HAL_Driver/Src/py32f0xx_hal_dma.c"/>
        </files>
      </component>
      <component Cgroup="PY32F0xx HAL Driver" Csub="EXTI" condition="PY32F0xx HAL">
        <description>EXTI Module</description>
        <files>
          <file category="source" name="Drivers/PY32F0xx_HAL_Driver/Src/py32f0xx_hal_exti.c"/>
        </files>
      </component>
      <component Cgroup="PY32F0xx HAL Driver" Csub="FLASH" condition="PY32F0xx HAL">
        <description>FLASH Module</description>
        <files>
          <file category="source" name="Drivers/PY32F0xx_HAL_Driver/Src/py32f0xx_hal_flash.c"/>
        </files>
      </component>
      <component Cgroup="PY32F0xx HAL Driver" Csub="GPIO" condition="PY32F0xx HAL">
        <description>GPIO Module</description>
        <files>
          <file category="source" name="Drivers/PY32F0xx_HAL_Driver/Src/py32f0xx_hal_gpio.c"/>
        </files>
      </component>
      <component Cgroup="PY32F0xx HAL Driver" Csub="I2C" condition="PY32F0xx HAL">
        <description>I2C Module</description>
        <files>
          <file category="source" name="Drivers/PY32F0xx_HAL_Driver/Src/py32f0xx_hal_i2c.c"/>
        </files>
      </component>
      <component Cgroup="PY32F0xx HAL Driver" Csub="IRDA" condition="PY32F0xx HAL">
        <description>IRDA Module</description>
        <files>
          <file category="source" name="Drivers/PY32F0xx_HAL_Driver/Src/py32f0xx_hal_irda.c"/>
        </files>
      </component>
      <component Cgroup="PY32F0xx HAL Driver" Csub="IWDG" condition="PY32F0xx HAL">
        <description>IWDG Module</description>
        <files>
          <file category="source" name="Drivers/PY32F0xx_HAL_Driver/Src/py32f0xx_hal_iwdg.c"/>
        </files>
      </component>
      <component Cgroup="PY32F0xx HAL Driver" Csub="LED" condition="PY32F0xx HAL">
        <description>LED Module</description>
        <files>
          <file category="source" name="Drivers/PY32F0xx_HAL_Driver/Src/py32f0xx_hal_led.c"/>
        </files>
      </component>
      <component Cgroup="PY32F0xx HAL Driver" Csub="LPTIM" condition="PY32F0xx HAL">
        <description>LPTIM Module</description>
        <files>
          <file category="source" name="Drivers/PY32F0xx_HAL_Driver/Src/py32f0xx_hal_lptim.c"/>
        </files>
      </component>
      <component Cgroup="PY32F0xx HAL Driver" Csub="PWR" condition="PY32F0xx HAL">
        <description>PWR Module</description>
        <files>
          <file category="source" name="Drivers/PY32F0xx_HAL_Driver/Src/py32f0xx_hal_pwr.c"/>
        </files>
      </component>
      <component Cgroup="PY32F0xx HAL Driver" Csub="RCC" condition="PY32F0xx HAL">
        <description>RCC Module</description>
        <files>
          <file category="source" name="Drivers/PY32F0xx_HAL_Driver/Src/py32f0xx_hal_rcc.c"/>
          <file category="source" name="Drivers/PY32F0xx_HAL_Driver/Src/py32f0xx_hal_rcc_ex.c"/>
        </files>
      </component>
      <component Cgroup="PY32F0xx HAL Driver" Csub="RTC" condition="PY32F0xx HAL">
        <description>RTC Module</description>
        <files>
          <file category="source" name="Drivers/PY32F0xx_HAL_Driver/Src/py32f0xx_hal_rtc.c"/>
          <file category="source" name="Drivers/PY32F0xx_HAL_Driver/Src/py32f0xx_hal_rtc_ex.c"/>
        </files>
      </component>
      <component Cgroup="PY32F0xx HAL Driver" Csub="SPI" condition="PY32F0xx HAL">
        <description>SPI Module</description>
        <files>
          <file category="source" name="Drivers/PY32F0xx_HAL_Driver/Src/py32f0xx_hal_spi.c"/>
        </files>
      </component>
      <component Cgroup="PY32F0xx HAL Driver" Csub="TIM" condition="PY32F0xx HAL">
        <description>TIM Module</description>
        <files>
          <file category="source" name="Drivers/PY32F0xx_HAL_Driver/Src/py32f0xx_hal_tim.c"/>
          <file category="source" name="Drivers/PY32F0xx_HAL_Driver/Src/py32f0xx_hal_tim_ex.c"/>
        </files>
      </component>
      <component Cgroup="PY32F0xx HAL Driver" Csub="UART" condition="PY32F0xx HAL">
        <description>UART Module</description>
        <files>
          <file category="source" name="Drivers/PY32F0xx_HAL_Driver/Src/py32f0xx_hal_uart.c"/>
        </files>
      </component>
