OpenPuya/PY32F0xx_Firmware/Packs/GCC/.pack/Puya/PY32F0xx_DFP/Puya.PY32F0xx_DFP.pdsc
      <component Cgroup="PY32F0xx HAL Driver" Csub="USART" condition="PY32F0xx HAL">
        <description>USART Module</description>
        <files>
          <file category="source" name="Drivers/PY32F0xx_HAL_Driver/Src/py32f0xx_hal_usart.c"/>
        </files>
      </component>
      <component Cgroup="PY32F0xx HAL Driver" Csub="WWDG" condition="PY32F0xx HAL">
        <description>WWDG Module</description>
        <files>
          <file category="source" name="Drivers/PY32F0xx_HAL_Driver/Src/py32f0xx_hal_wwdg.c"/>
        </files>
      </component>

      <component Cgroup="PY32F0xx LL Driver" Csub="COMMON" condition="PY32F0xx HAL">
        <description>COMMON Module</description>
        <Pre_Include_Global_h>
#define USE_HAL_DRIVER
#define USE_FULL_LL_DRIVER
        </Pre_Include_Global_h>
        <files>
          <file category="include" name="Drivers/PY32F0xx_HAL_Driver/Inc/"/>
          <file category="source" name="Drivers/PY32F0xx_HAL_Driver/Src/py32f0xx_ll_utils.c"/>
        </files>
      </component>
      <component Cgroup="PY32F0xx LL Driver" Csub="ADC" condition="PY32F0xx HAL">
        <description>ADC Module</description>
        <files>
          <file category="source" name="Drivers/PY32F0xx_HAL_Driver/Src/py32f0xx_ll_adc.c"/>
        </files>
      </component>
      <component Cgroup="PY32F0xx LL Driver" Csub="COMP" condition="PY32F0xx HAL">
        <description>COMP Module</description>
        <files>
          <file category="source" name="Drivers/PY32F0xx_HAL_Driver/Src/py32f0xx_ll_comp.c"/>
        </files>
      </component>
      <component Cgroup="PY32F0xx LL Driver" Csub="CRC" condition="PY32F0xx HAL">
        <description>CRC Module</description>
        <files>
          <file category="source" name="Drivers/PY32F0xx_HAL_Driver/Src/py32f0xx_ll_crc.c"/>
        </files>
      </component>
      <component Cgroup="PY32F0xx LL Driver" Csub="DMA" condition="PY32F0xx HAL">
        <description>DMA Module</description>
        <files>
          <file category="source" name="Drivers/PY32F0xx_HAL_Driver/Src/py32f0xx_ll_dma.c"/>
        </files>
      </component>
      <component Cgroup="PY32F0xx LL Driver" Csub="EXTI" condition="PY32F0xx HAL">
        <description>EXTI Module</description>
        <files>
          <file category="source" name="Drivers/PY32F0xx_HAL_Driver/Src/py32f0xx_ll_exti.c"/>
        </files>
      </component>
      <component Cgroup="PY32F0xx LL Driver" Csub="GPIO" condition="PY32F0xx HAL">
        <description>GPIO Module</description>
        <files>
          <file category="source" name="Drivers/PY32F0xx_HAL_Driver/Src/py32f0xx_ll_gpio.c"/>
        </files>
      </component>
      <component Cgroup="PY32F0xx LL Driver" Csub="I2C" condition="PY32F0xx HAL">
        <description>I2C Module</description>
        <files>
          <file category="source" name="Drivers/PY32F0xx_HAL_Driver/Src/py32f0xx_ll_i2c.c"/>
        </files>
      </component>
      <component Cgroup="PY32F0xx LL Driver" Csub="LED" condition="PY32F0xx HAL">
        <description>LED Module</description>
        <files>
          <file category="source" name="Drivers/PY32F0xx_HAL_Driver/Src/py32f0xx_ll_led.c"/>
        </files>
      </component>
      <component Cgroup="PY32F0xx LL Driver" Csub="LPTIM" condition="PY32F0xx HAL">
        <description>LPTIM Module</description>
        <files>
          <file category="source" name="Drivers/PY32F0xx_HAL_Driver/Src/py32f0xx_ll_lptim.c"/>
        </files>
      </component>
      <component Cgroup="PY32F0xx LL Driver" Csub="PWR" condition="PY32F0xx HAL">
        <description>PWR Module</description>
        <files>
          <file category="source" name="Drivers/PY32F0xx_HAL_Driver/Src/py32f0xx_ll_pwr.c"/>
        </files>
      </component>
      <component Cgroup="PY32F0xx LL Driver" Csub="RCC" condition="PY32F0xx HAL">
        <description>RCC Module</description>
        <files>
          <file category="source" name="Drivers/PY32F0xx_HAL_Driver/Src/py32f0xx_ll_rcc.c"/>
        </files>
      </component>
      <component Cgroup="PY32F0xx LL Driver" Csub="RTC" condition="PY32F0xx HAL">
        <description>RTC Module</description>
        <files>
          <file category="source" name="Drivers/PY32F0xx_HAL_Driver/Src/py32f0xx_ll_rtc.c"/>
        </files>
      </component>
      <component Cgroup="PY32F0xx LL Driver" Csub="SPI" condition="PY32F0xx HAL">
        <description>SPI Module</description>
        <files>
          <file category="source" name="Drivers/PY32F0xx_HAL_Driver/Src/py32f0xx_ll_spi.c"/>
        </files>
      </component>
      <component Cgroup="PY32F0xx LL Driver" Csub="USART" condition="PY32F0xx HAL">
        <description>USART Module</description>
        <files>
          <file category="source" name="Drivers/PY32F0xx_HAL_Driver/Src/py32f0xx_ll_usart.c"/>
        </files>
      </component>
    </bundle>

    <bundle Cbundle="PY32F072 Standalone" Cclass="Drivers" Cversion="0.0.5">
      <description>PY32F072 Standalone Drivers</description>
      <doc>Drivers/PY32F072_HAL_Driver</doc>
      <component Cgroup="PY32F072 HAL Driver" Csub="COMMON" condition="PY32F072 HAL">
        <description>COMMON Module</description>
        <Pre_Include_Global_h>
#define USE_HAL_DRIVER
#define USE_FULL_LL_DRIVER
        </Pre_Include_Global_h>
        <files>
          <file category="include" name="Drivers/PY32F072_HAL_Driver/Inc/"/>
          <file category="source" name="Drivers/PY32F072_HAL_Driver/Src/py32f072_hal.c"/>
          <file category="header" name="MDK/Templates/PY32F072/Inc/py32f072_hal_conf.h" attr="config" version="0.0.5"/>
        </files>
      </component>
      <component Cgroup="PY32F072 HAL Driver" Csub="ADC" condition="PY32F072 HAL">
        <description>ADC Module</description>
        <files>
          <file category="source" name="Drivers/PY32F072_HAL_Driver/Src/py32f072_hal_adc.c"/>
          <file category="source" name="Drivers/PY32F072_HAL_Driver/Src/py32f072_hal_adc_ex.c"/>
        </files>
      </component>
      <component Cgroup="PY32F072 HAL Driver" Csub="COMP" condition="PY32F072 HAL">
        <description>COMP Module</description>
        <files>
          <file category="source" name="Drivers/PY32F072_HAL_Driver/Src/py32f072_hal_comp.c"/>
        </files>
      </component>
      <component Cgroup="PY32F072 HAL Driver" Csub="CORTEX" condition="PY32F072 HAL">
        <description>CORTEX Module</description>
        <files>
          <file category="source" name="Drivers/PY32F072_HAL_Driver/Src/py32f072_hal_cortex.c"/>
        </files>
      </component>
      <component Cgroup="PY32F072 HAL Driver" Csub="CRC" condition="PY32F072 HAL">
        <description>CRC Module</description>
        <files>
          <file category="source" name="Drivers/PY32F072_HAL_Driver/Src/py32f072_hal_crc.c"/>
        </files>
      </component>
      <component Cgroup="PY32F072 HAL Driver" Csub="CTC" condition="PY32F072 HAL">
        <description>CTC Module</description>
        <files>
          <file category="source" name="Drivers/PY32F072_HAL_Driver/Src/py32f072_hal_ctc.c"/>
        </files>
      </component>
      <component Cgroup="PY32F072 HAL Driver" Csub="DAC" condition="PY32F072 HAL">
        <description>DAC Module</description>
        <files>
          <file category="source" name="Drivers/PY32F072_HAL_Driver/Src/py32f072_hal_dac.c"/>
          <file category="source" name="Drivers/PY32F072_HAL_Driver/Src/py32f072_hal_dac_ex.c"/>
        </files>
      </component>
