OpenPuya/PY32F0xx_Firmware/Packs/GCC/.pack/Puya/PY32F0xx_DFP/Puya.PY32F0xx_DFP.pdsc
      <component Cgroup="PY32F072 HAL Driver" Csub="DIV" condition="PY32F072 HAL">
        <description>DIV Module</description>
        <files>
          <file category="source" name="Drivers/PY32F072_HAL_Driver/Src/py32f072_hal_div.c"/>
        </files>
      </component>
      <component Cgroup="PY32F072 HAL Driver" Csub="DMA" condition="PY32F072 HAL">
        <description>DMA Module</description>
        <files>
          <file category="source" name="Drivers/PY32F072_HAL_Driver/Src/py32f072_hal_dma.c"/>
        </files>
      </component>
      <component Cgroup="PY32F072 HAL Driver" Csub="EXTI" condition="PY32F072 HAL">
        <description>EXTI Module</description>
        <files>
          <file category="source" name="Drivers/PY32F072_HAL_Driver/Src/py32f072_hal_exti.c"/>
        </files>
      </component>
      <component Cgroup="PY32F072 HAL Driver" Csub="FLASH" condition="PY32F072 HAL">
        <description>FLASH Module</description>
        <files>
          <file category="source" name="Drivers/PY32F072_HAL_Driver/Src/py32f072_hal_flash.c"/>
        </files>
      </component>
      <component Cgroup="PY32F072 HAL Driver" Csub="GPIO" condition="PY32F072 HAL">
        <description>GPIO Module</description>
        <files>
          <file category="source" name="Drivers/PY32F072_HAL_Driver/Src/py32f072_hal_gpio.c"/>
        </files>
      </component>
      <component Cgroup="PY32F072 HAL Driver" Csub="I2C" condition="PY32F072 HAL">
        <description>I2C Module</description>
        <files>
          <file category="source" name="Drivers/PY32F072_HAL_Driver/Src/py32f072_hal_i2c.c"/>
        </files>
      </component>
      <component Cgroup="PY32F072 HAL Driver" Csub="I2S" condition="PY32F072 HAL">
        <description>I2S Module</description>
        <files>
          <file category="source" name="Drivers/PY32F072_HAL_Driver/Src/py32f072_hal_i2s.c"/>
        </files>
      </component>
      <component Cgroup="PY32F072 HAL Driver" Csub="IRDA" condition="PY32F072 HAL">
        <description>IRDA Module</description>
        <files>
          <file category="source" name="Drivers/PY32F072_HAL_Driver/Src/py32f072_hal_irda.c"/>
        </files>
      </component>
      <component Cgroup="PY32F072 HAL Driver" Csub="IWDG" condition="PY32F072 HAL">
        <description>IWDG Module</description>
        <files>
          <file category="source" name="Drivers/PY32F072_HAL_Driver/Src/py32f072_hal_iwdg.c"/>
        </files>
      </component>
      <component Cgroup="PY32F072 HAL Driver" Csub="LCD" condition="PY32F072 HAL">
        <description>LCD Module</description>
        <files>
          <file category="source" name="Drivers/PY32F072_HAL_Driver/Src/py32f072_hal_lcd.c"/>
        </files>
      </component>
      <component Cgroup="PY32F072 HAL Driver" Csub="LPTIM" condition="PY32F072 HAL">
        <description>LPTIM Module</description>
        <files>
          <file category="source" name="Drivers/PY32F072_HAL_Driver/Src/py32f072_hal_lptim.c"/>
        </files>
      </component>
      <component Cgroup="PY32F072 HAL Driver" Csub="OPA" condition="PY32F072 HAL">
        <description>OPA Module</description>
        <files>
          <file category="source" name="Drivers/PY32F072_HAL_Driver/Src/py32f072_hal_opa.c"/>
          <file category="source" name="Drivers/PY32F072_HAL_Driver/Src/py32f072_hal_opa_ex.c"/>
        </files>
      </component>
      <component Cgroup="PY32F072 HAL Driver" Csub="PWR" condition="PY32F072 HAL">
        <description>PWR Module</description>
        <files>
          <file category="source" name="Drivers/PY32F072_HAL_Driver/Src/py32f072_hal_pwr.c"/>
        </files>
      </component>
      <component Cgroup="PY32F072 HAL Driver" Csub="RCC" condition="PY32F072 HAL">
        <description>RCC Module</description>
        <files>
          <file category="source" name="Drivers/PY32F072_HAL_Driver/Src/py32f072_hal_rcc.c"/>
          <file category="source" name="Drivers/PY32F072_HAL_Driver/Src/py32f072_hal_rcc_ex.c"/>
        </files>
      </component>
      <component Cgroup="PY32F072 HAL Driver" Csub="RTC" condition="PY32F072 HAL">
        <description>RTC Module</description>
        <files>
          <file category="source" name="Drivers/PY32F072_HAL_Driver/Src/py32f072_hal_rtc.c"/>
          <file category="source" name="Drivers/PY32F072_HAL_Driver/Src/py32f072_hal_rtc_ex.c"/>
        </files>
      </component>
      <component Cgroup="PY32F072 HAL Driver" Csub="SMARTCARD" condition="PY32F072 HAL">
        <description>SMARTCARD Module</description>
        <files>
          <file category="source" name="Drivers/PY32F072_HAL_Driver/Src/py32f072_hal_smartcard.c"/>
        </files>
      </component>
      <component Cgroup="PY32F072 HAL Driver" Csub="SPI" condition="PY32F072 HAL">
        <description>SPI Module</description>
        <files>
          <file category="source" name="Drivers/PY32F072_HAL_Driver/Src/py32f072_hal_spi.c"/>
        </files>
      </component>
      <component Cgroup="PY32F072 HAL Driver" Csub="TIM" condition="PY32F072 HAL">
        <description>TIM Module</description>
        <files>
          <file category="source" name="Drivers/PY32F072_HAL_Driver/Src/py32f072_hal_tim.c"/>
          <file category="source" name="Drivers/PY32F072_HAL_Driver/Src/py32f072_hal_tim_ex.c"/>
        </files>
      </component>
      <component Cgroup="PY32F072 HAL Driver" Csub="UART" condition="PY32F072 HAL">
        <description>UART Module</description>
        <files>
          <file category="source" name="Drivers/PY32F072_HAL_Driver/Src/py32f072_hal_uart.c"/>
        </files>
      </component>
      <component Cgroup="PY32F072 HAL Driver" Csub="USART" condition="PY32F072 HAL">
        <description>USART Module</description>
        <files>
          <file category="source" name="Drivers/PY32F072_HAL_Driver/Src/py32f072_hal_usart.c"/>
        </files>
      </component>
      <component Cgroup="PY32F072 HAL Driver" Csub="WWDG" condition="PY32F072 HAL">
        <description>WWDG Module</description>
        <files>
          <file category="source" name="Drivers/PY32F072_HAL_Driver/Src/py32f072_hal_wwdg.c"/>
        </files>
      </component>

