OpenPuya/PY32F0xx_Firmware/Packs/GCC/.pack/Puya/PY32F0xx_DFP/Puya.PY32F0xx_DFP.pdsc
      <component Cgroup="PY32F072 LL Driver" Csub="ADC" condition="PY32F072 HAL">
        <description>ADC Module</description>
        <files>
          <file category="source" name="Drivers/PY32F072_HAL_Driver/Src/py32f072_ll_adc.c"/>
        </files>
      </component>
      <component Cgroup="PY32F072 LL Driver" Csub="COMP" condition="PY32F072 HAL">
        <description>COMP Module</description>
        <files>
          <file category="source" name="Drivers/PY32F072_HAL_Driver/Src/py32f072_ll_comp.c"/>
        </files>
      </component>
      <component Cgroup="PY32F072 LL Driver" Csub="CRC" condition="PY32F072 HAL">
        <description>CRC Module</description>
        <files>
          <file category="source" name="Drivers/PY32F072_HAL_Driver/Src/py32f072_ll_crc.c"/>
        </files>
      </component>
      <component Cgroup="PY32F072 LL Driver" Csub="CTC" condition="PY32F072 HAL">
        <description>CTC Module</description>
        <files>
          <file category="source" name="Drivers/PY32F072_HAL_Driver/Src/py32f072_ll_ctc.c"/>
        </files>
      </component>
      <component Cgroup="PY32F072 LL Driver" Csub="DAC" condition="PY32F072 HAL">
        <description>DAC Module</description>
        <files>
          <file category="source" name="Drivers/PY32F072_HAL_Driver/Src/py32f072_ll_dac.c"/>
        </files>
      </component>
      <component Cgroup="PY32F072 LL Driver" Csub="DMA" condition="PY32F072 HAL">
        <description>DMA Module</description>
        <files>
          <file category="source" name="Drivers/PY32F072_HAL_Driver/Src/py32f072_ll_dma.c"/>
        </files>
      </component>
      <component Cgroup="PY32F072 LL Driver" Csub="EXTI" condition="PY32F072 HAL">
        <description>EXTI Module</description>
        <files>
          <file category="source" name="Drivers/PY32F072_HAL_Driver/Src/py32f072_ll_exti.c"/>
        </files>
      </component>
      <component Cgroup="PY32F072 LL Driver" Csub="GPIO" condition="PY32F072 HAL">
        <description>GPIO Module</description>
        <files>
          <file category="source" name="Drivers/PY32F072_HAL_Driver/Src/py32f072_ll_gpio.c"/>
        </files>
      </component>
      <component Cgroup="PY32F072 LL Driver" Csub="I2C" condition="PY32F072 HAL">
        <description>I2C Module</description>
        <files>
          <file category="source" name="Drivers/PY32F072_HAL_Driver/Src/py32f072_ll_i2c.c"/>
        </files>
      </component>
      <component Cgroup="PY32F072 LL Driver" Csub="LCD" condition="PY32F072 HAL">
        <description>LCD Module</description>
        <files>
          <file category="source" name="Drivers/PY32F072_HAL_Driver/Src/py32f072_ll_lcd.c"/>
        </files>
      </component>
      <component Cgroup="PY32F072 LL Driver" Csub="LPTIM" condition="PY32F072 HAL">
        <description>LPTIM Module</description>
        <files>
          <file category="source" name="Drivers/PY32F072_HAL_Driver/Src/py32f072_ll_lptim.c"/>
        </files>
      </component>
      <component Cgroup="PY32F072 LL Driver" Csub="PWR" condition="PY32F072 HAL">
        <description>PWR Module</description>
        <files>
          <file category="source" name="Drivers/PY32F072_HAL_Driver/Src/py32f072_ll_pwr.c"/>
        </files>
      </component>
      <component Cgroup="PY32F072 LL Driver" Csub="RCC" condition="PY32F072 HAL">
        <description>RCC Module</description>
        <files>
          <file category="source" name="Drivers/PY32F072_HAL_Driver/Src/py32f072_ll_rcc.c"/>
        </files>
      </component>
      <component Cgroup="PY32F072 LL Driver" Csub="RTC" condition="PY32F072 HAL">
        <description>RTC Module</description>
        <files>
          <file category="source" name="Drivers/PY32F072_HAL_Driver/Src/py32f072_ll_rtc.c"/>
        </files>
      </component>
      <component Cgroup="PY32F072 LL Driver" Csub="SPI" condition="PY32F072 HAL">
        <description>SPI Module</description>
        <files>
          <file category="source" name="Drivers/PY32F072_HAL_Driver/Src/py32f072_ll_spi.c"/>
        </files>
      </component>
      <component Cgroup="PY32F072 LL Driver" Csub="TIM" condition="PY32F072 HAL">
        <description>TIM Module</description>
        <files>
          <file category="source" name="Drivers/PY32F072_HAL_Driver/Src/py32f072_ll_tim.c"/>
        </files>
      </component>
      <component Cgroup="PY32F072 LL Driver" Csub="USART" condition="PY32F072 HAL">
        <description>USART Module</description>
        <files>
          <file category="source" name="Drivers/PY32F072_HAL_Driver/Src/py32f072_ll_usart.c"/>
        </files>
      </component>
      <component Cgroup="PY32F072 LL Driver" Csub="UTILS" condition="PY32F072 HAL">
        <description>UTILS Module</description>
        <files>
          <file category="source" name="Drivers/PY32F072_HAL_Driver/Src/py32f072_ll_utils.c"/>
        </files>
      </component>
    </bundle>

    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="PY32F0 CMSIS">
      <description>System Startup for Puya PY32F0 Series</description>
      <files>
        <!--  include folder -->
        <file category="include" name="Drivers/CMSIS/Device/Puya/PY32F0xx/Include/"/>
        <!-- common device header file -->
        <file category="header" name="Drivers/CMSIS/Device/Puya/PY32F0xx/Include/py32f0xx.h"/>

        <file category="source" condition="PY32F002Ax5 ARMCC" name="Drivers/CMSIS/Device/Puya/PY32F0xx/Source/Templates/arm/startup_py32f002ax5.s" attr="config" version="1.0.0"/>
        <file category="source" condition="PY32F002Bx5 ARMCC" name="Drivers/CMSIS/Device/Puya/PY32F0xx/Source/Templates/arm/startup_py32f002bx5.s" attr="config" version="1.0.0"/>
        <file category="source" condition="PY32F002Xx2 ARMCC" name="Drivers/CMSIS/Device/Puya/PY32F0xx/Source/Templates/arm/startup_py32f002xxx.s" attr="config" version="1.0.0"/>
        <file category="source" condition="PY32F002Xx4 ARMCC" name="Drivers/CMSIS/Device/Puya/PY32F0xx/Source/Templates/arm/startup_py32f002xxx.s" attr="config" version="1.0.0"/>
        <file category="source" condition="PY32F002Xx5 ARMCC" name="Drivers/CMSIS/Device/Puya/PY32F0xx/Source/Templates/arm/startup_py32f002xxx.s" attr="config" version="1.0.0"/>
        <file category="source" condition="PY32F003x4 ARMCC" name="Drivers/CMSIS/Device/Puya/PY32F0xx/Source/Templates/arm/startup_py32f003x4.s" attr="config" version="1.0.0"/>
        <file category="source" condition="PY32F003x6 ARMCC" name="Drivers/CMSIS/Device/Puya/PY32F0xx/Source/Templates/arm/startup_py32f003x6.s" attr="config" version="1.0.0"/>
        <file category="source" condition="PY32F003x7 ARMCC" name="Drivers/CMSIS/Device/Puya/PY32F0xx/Source/Templates/arm/startup_py32f003x7.s" attr="config" version="1.0.0"/>
        <file category="source" condition="PY32F003x8 ARMCC" name="Drivers/CMSIS/Device/Puya/PY32F0xx/Source/Templates/arm/startup_py32f003x8.s" attr="config" version="1.0.0"/>
        <file category="source" condition="PY32F030x4 ARMCC" name="Drivers/CMSIS/Device/Puya/PY32F0xx/Source/Templates/arm/startup_py32f030x4.s" attr="config" version="1.0.0"/>
        <file category="source" condition="PY32F030x6 ARMCC" name="Drivers/CMSIS/Device/Puya/PY32F0xx/Source/Templates/arm/startup_py32f030x6.s" attr="config" version="1.0.0"/>
        <file category="source" condition="PY32F030x7 ARMCC" name="Drivers/CMSIS/Device/Puya/PY32F0xx/Source/Templates/arm/startup_py32f030x7.s" attr="config" version="1.0.0"/>
        <file category="source" condition="PY32F030x8 ARMCC" name="Drivers/CMSIS/Device/Puya/PY32F0xx/Source/Templates/arm/startup_py32f030x8.s" attr="config" version="1.0.0"/>
        <file category="source" condition="PY32F031x4 ARMCC" name="Drivers/CMSIS/Device/Puya/PY32F0xx/Source/Templates/arm/startup_py32f031x4.s" attr="config" version="1.0.0"/>
        <file category="source" condition="PY32F031x6 ARMCC" name="Drivers/CMSIS/Device/Puya/PY32F0xx/Source/Templates/arm/startup_py32f031x6.s" attr="config" version="1.0.0"/>
        <file category="source" condition="PY32F031x7 ARMCC" name="Drivers/CMSIS/Device/Puya/PY32F0xx/Source/Templates/arm/startup_py32f031x7.s" attr="config" version="1.0.0"/>
        <file category="source" condition="PY32F031x8 ARMCC" name="Drivers/CMSIS/Device/Puya/PY32F0xx/Source/Templates/arm/startup_py32f031x8.s" attr="config" version="1.0.0"/>
        <file category="source" condition="PY32F040x6 ARMCC" name="Drivers/CMSIS/Device/Puya/PY32F0xx/Source/Templates/arm/startup_py32f040x6.s" attr="config" version="1.0.0"/>
        <file category="source" condition="PY32F040x8 ARMCC" name="Drivers/CMSIS/Device/Puya/PY32F0xx/Source/Templates/arm/startup_py32f040x8.s" attr="config" version="1.0.0"/>
        <file category="source" condition="PY32F040x9 ARMCC" name="Drivers/CMSIS/Device/Puya/PY32F0xx/Source/Templates/arm/startup_py32f040x9.s" attr="config" version="1.0.0"/>
        <file category="source" condition="PY32F040xB ARMCC" name="Drivers/CMSIS/Device/Puya/PY32F0xx/Source/Templates/arm/startup_py32f040xB.s" attr="config" version="1.0.0"/>
        <file category="source" condition="PY32F040Cx6 ARMCC" name="Drivers/CMSIS/Device/Puya/PY32F0xx/Source/Templates/arm/startup_py32f040x6.s" attr="config" version="1.0.0"/>
        <file category="source" condition="PY32F040Cx8 ARMCC" name="Drivers/CMSIS/Device/Puya/PY32F0xx/Source/Templates/arm/startup_py32f040x8.s" attr="config" version="1.0.0"/>
        <file category="source" condition="PY32F040Cx9 ARMCC" name="Drivers/CMSIS/Device/Puya/PY32F0xx/Source/Templates/arm/startup_py32f040x9.s" attr="config" version="1.0.0"/>
        <file category="source" condition="PY32F040CxB ARMCC" name="Drivers/CMSIS/Device/Puya/PY32F0xx/Source/Templates/arm/startup_py32f040xB.s" attr="config" version="1.0.0"/>
        <file category="source" condition="PY32F071x6 ARMCC" name="Drivers/CMSIS/Device/Puya/PY32F0xx/Source/Templates/arm/startup_py32f071x6.s" attr="config" version="1.0.0"/>
        <file category="source" condition="PY32F071x8 ARMCC" name="Drivers/CMSIS/Device/Puya/PY32F0xx/Source/Templates/arm/startup_py32f071x8.s" attr="config" version="1.0.0"/>
        <file category="source" condition="PY32F071x9 ARMCC" name="Drivers/CMSIS/Device/Puya/PY32F0xx/Source/Templates/arm/startup_py32f071x9.s" attr="config" version="1.0.0"/>
        <file category="source" condition="PY32F071xB ARMCC" name="Drivers/CMSIS/Device/Puya/PY32F0xx/Source/Templates/arm/startup_py32f071xB.s" attr="config" version="1.0.0"/>
        <file category="source" condition="PY32F071Cx6 ARMCC" name="Drivers/CMSIS/Device/Puya/PY32F0xx/Source/Templates/arm/startup_py32f071x6.s" attr="config" version="1.0.0"/>
        <file category="source" condition="PY32F071Cx8 ARMCC" name="Drivers/CMSIS/Device/Puya/PY32F0xx/Source/Templates/arm/startup_py32f071x8.s" attr="config" version="1.0.0"/>
        <file category="source" condition="PY32F071Cx9 ARMCC" name="Drivers/CMSIS/Device/Puya/PY32F0xx/Source/Templates/arm/startup_py32f071x9.s" attr="config" version="1.0.0"/>
        <file category="source" condition="PY32F071CxB ARMCC" name="Drivers/CMSIS/Device/Puya/PY32F0xx/Source/Templates/arm/startup_py32f071xB.s" attr="config" version="1.0.0"/>
        <file category="source" condition="PY32F072x6 ARMCC" name="Drivers/CMSIS/Device/Puya/PY32F0xx/Source/Templates/arm/startup_py32f072x6.s" attr="config" version="1.0.0"/>
        <file category="source" condition="PY32F072x8 ARMCC" name="Drivers/CMSIS/Device/Puya/PY32F0xx/Source/Templates/arm/startup_py32f072x8.s" attr="config" version="1.0.0"/>
        <file category="source" condition="PY32F072x9 ARMCC" name="Drivers/CMSIS/Device/Puya/PY32F0xx/Source/Templates/arm/startup_py32f072x9.s" attr="config" version="1.0.0"/>
        <file category="source" condition="PY32F072xB ARMCC" name="Drivers/CMSIS/Device/Puya/PY32F0xx/Source/Templates/arm/startup_py32f072xB.s" attr="config" version="1.0.0"/>
        <file category="source" condition="PY32F072Cx6 ARMCC" name="Drivers/CMSIS/Device/Puya/PY32F0xx/Source/Templates/arm/startup_py32f072x6.s" attr="config" version="1.0.0"/>
        <file category="source" condition="PY32F072Cx8 ARMCC" name="Drivers/CMSIS/Device/Puya/PY32F0xx/Source/Templates/arm/startup_py32f072x8.s" attr="config" version="1.0.0"/>
        <file category="source" condition="PY32F072Cx9 ARMCC" name="Drivers/CMSIS/Device/Puya/PY32F0xx/Source/Templates/arm/startup_py32f072x9.s" attr="config" version="1.0.0"/>
        <file category="source" condition="PY32F072CxB ARMCC" name="Drivers/CMSIS/Device/Puya/PY32F0xx/Source/Templates/arm/startup_py32f072xB.s" attr="config" version="1.0.0"/>

        <file category="source" name="Drivers/CMSIS/Device/Puya/PY32F0xx/Source/Templates/system_py32f0xx.c" attr="config" version="1.0.0"/>
      </files>
    </component>
  </components>
</package>

